{
    "Apple": {
        "Apple hit with $1.2B lawsuit after killing controversial CSAM-detecting tool. Apple knowingly ignoring child porn is a \"never-ending nightmare,\" lawsuit says.": {
            "Post_Info": {
                "Title": "Apple hit with $1.2B lawsuit after killing controversial CSAM-detecting tool. Apple knowingly ignoring child porn is a \"never-ending nightmare,\" lawsuit says.",
                "Score": 6198,
                "Comments": 511,
                "Created": "2024-12-10 08:06:04",
                "Subreddit": "technology",
                "Author": "Sariel007",
                "URL": "https://arstechnica.com/tech-policy/2024/12/thousands-of-child-sex-abuse-victims-sue-apple-for-lax-csam-reporting/",
                "Content": ""
            },
            "Comments": {
                "Catching child predators is great, but I'm not going to buy any devices that automatically conduct warrantless searches and analyze my data on behalf of law enforcement.  \n\n\nI know it's naive to think it's not already happening to some degree. But I'm going to vote with my dollar at every chance I get.": {
                    "Sentimental_Value": "Positive"
                },
                "FBI unhappy over Apple denying backdoor to citizen's private iCloud. 😑": {
                    "Sentimental_Value": "Negative"
                },
                "Remember, if this was really about CSAM, they’d go after companies like Snapchat": {
                    "Sentimental_Value": "Negative"
                },
                "The falsely leading headline is quite annoying.": {
                    "Sentimental_Value": "Negative"
                },
                "I do not like apple. From the deepest of my heart. \n\nBut this is bullshit. Remember guys. When they tell you it's \"for the kids\" and to \"protect our kids from [insert random shit]\" IT IS NOT ABOUT THE KIDS!\n\nFuck apple. But not this time.": {
                    "Sentimental_Value": "Negative"
                },
                "I fail to see how this is Apple's problem. Government and law enforcement can hire their own developers and make their own software.": {
                    "Sentimental_Value": "Negative"
                },
                "The lawsuit can say whatever. Apple would need to battle A suit one way or another: either this one for \"storing forbidden material\", or, another one for \"unauthorized assess to private user content on their servers\". Choose your poison. At least in its present stance, it does not jeopardize its business.": {
                    "Sentimental_Value": "Negative"
                },
                "They dress it up as a CSAM detection tool, but in actuality it's a constitution violating privacy invasion tool.": {
                    "Sentimental_Value": "Negative"
                },
                "Every time you see \"think of the children\", you should stay on guard - because clearly, someone is looking to take away your rights.\n\nThe reasons why Apple axed this scanner tool? It's because it's a privacy nightmare - which quickly turned into a PR nightmare for Apple after people took notice of those plans.\n\nI'm no Apple fanboy, but I hope that this lawsuit gets thrown out hard. Apple shouldn't be responsible for policing their phone users any more than a tool shop should be responsible for policing everyone they sell an axe to.": {
                    "Sentimental_Value": "Negative"
                },
                "I'm getting bored of this trope that the government needs access to all our information to save children from being diddled by sickos.\n\nMeanwhile all the elites who actually ARE diddling children are getting away with it.": {
                    "Sentimental_Value": "Negative"
                },
                "Has the FBI tried not being evil?\n\nEverybody acts all butthurt and can’t believe that American citizens would dislike a stoic, patriotic, dignified entity like the FBI, who only works to protect Americans… and then the FBI works directly against the constitutional interests of Americans. \n\nConstitutional protections are too strong for them, so they try to bully their way around them.": {
                    "Sentimental_Value": "Negative"
                },
                "They always use this shit when they wanna take your rights and spy on you. will someone think of the children waaah waah.": {
                    "Sentimental_Value": "Negative"
                },
                "this is one of the most stupid lawsuits\n\nOn one hand we don't want to have backdoors and chat/photo scanning. On the other hand we want somehow to stop child porn but without violating the previous condition.   \nthis cannot happen people": {
                    "Sentimental_Value": "Negative"
                },
                "It's always protect the children, until actual kids disappear never to be seen, then it's something else. It's so fucking tiresome at this point.": {
                    "Sentimental_Value": "Negative"
                },
                "4th amendment does not exist apparently. \n\nCP is horrific but I shouldn’t have to give up my rights because of the perverse intentions of others.": {
                    "Sentimental_Value": "Negative"
                },
                "Child pornography will be the excuse they use to take away all of our digital privacy.": {
                    "Sentimental_Value": "Negative"
                },
                "While I understand the importance of fighting CSAM, it's messed up that the rest of the regular people have to have their data pried on for a service they paid for specifically get the privilege of privacy.\n\n\nI mean, landlords or hotels aren't just gonna install cameras in every tenant or client's room to prevent domestic violence and child abuse... \n\n\nAnd probably most of the bad guys can and just store their stuff in some cheap storage drive anyways.": {
                    "Sentimental_Value": "Negative"
                },
                "Congress will be coming for end-to-end encryption and possibly VPNs before July. MMW": {
                    "Sentimental_Value": "Positive"
                },
                "I'm with Apple on this. This is the government way of invading our privacy. Where's the line?": {
                    "Sentimental_Value": "Negative"
                },
                "“NO, YOU HAVE TO GIVE THE GOVERNMENT ACCESS TO ALL OF YOUR PHOTOS OTHERWISE YOU WANT CHILDREN TO BE RAPED!” \\~ three letter agency employees, paying third parties to read their scripts": {
                    "Sentimental_Value": "Neutral"
                }
            }
        },
        "Apple’s iPhone Hit By FBI Warning And Lawsuit Before iOS 18.2 Release": {
            "Post_Info": {
                "Title": "Apple’s iPhone Hit By FBI Warning And Lawsuit Before iOS 18.2 Release",
                "Score": 2853,
                "Comments": 235,
                "Created": "2024-12-09 09:44:40",
                "Subreddit": "technology",
                "Author": "lurker_bee",
                "URL": "https://www.forbes.com/sites/zakdoffman/2024/12/08/apples-iphone-security-suddenly-under-attack-all-users-now-at-risk/",
                "Content": ""
            },
            "Comments": {
                "WARNING! The link in question may require you to disable ad-blockers to see content.  Though not required, please consider submitting an alternative source for this story.\n\nWARNING! Disabling your ad blocker may open you up to malware infections, malicious cookies and can expose you to unwanted tracker networks.  PROCEED WITH CAUTION.\n\nDo not open any files which are automatically downloaded, and do not enter personal information on any page you do not trust. \nIf you are concerned about tracking, consider opening the page in an incognito window, and verify that your browser is sending \"do not track\" requests.  \n\nIF YOU ENCOUNTER ANY MALWARE, MALICIOUS TRACKERS, CLICKJACKING, OR REDIRECT LOOPS PLEASE MESSAGE THE /r/technology MODERATORS IMMEDIATELY.  \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/technology) if you have any questions or concerns.*": {
                    "Sentimental_Value": "Negative"
                },
                "TLDR: FBI wants to spy on you, and is pissed Apple won't let them easily do so.   \nPlease donate to [www.eff.org](http://www.eff.org) to help fight government surveillance.": {
                    "Sentimental_Value": "Neutral"
                },
                "As usual it’s the FBI trying their nonsense.  They’ve tried this before, and Apple has told them in no uncertain terms that this won’t happen as it constitutes a freedom of speech violation.  Apple, and its developers cannot be forced to add code by the government.  We’ve now seen the danger backdoors pose that was warned for decades by researchers.  FBI can pound sand.": {
                    "Sentimental_Value": "Negative"
                },
                "Did they not just warn us the other day to use encrypted apps to send and receive messages?": {
                    "Sentimental_Value": "Negative"
                },
                "Didn’t they just announce AT&T, T-Mobile, and Verizon were targeted by Chinese hackers a few weeks ago (using backdoors set by US government agencies)? Now they want a backdoor built into the OS of the phone to make it more convenient for themselves?": {
                    "Sentimental_Value": "Negative"
                },
                "It’s for the children!": {
                    "Sentimental_Value": "Neutral"
                },
                "Classic US government . “encryption is really good everyone! unless we can’t decrypt it, in which case it is really bad, for, you know, obvious reasons”.": {
                    "Sentimental_Value": "Negative"
                },
                "Politicians need to understand that if encryption is banned, or backdoors are compulsory, the number one target of the hackers will be the politicians\n\nEverything will be made public\n\n*Everything*\n\nEvery phone call, text, email, voicemail, message, bank transaction, investment, payoff, where they have been, who they met with, everything.\n\nIt will be open season, and they will have zero secrecy\n\nBe careful what you wish for": {
                    "Sentimental_Value": "Neutral"
                },
                "When is 18.2 supposed to be out?": {
                    "Sentimental_Value": "Negative"
                },
                "Really cynical saying they need to backdoor everyone’s encryption in case there’s CSAM there. Incredibly cynical. “Hey we need keys to unlock everyone’s houses and closets and safes in case we want to look for illegal stuff”. 4th amendment in tatters": {
                    "Sentimental_Value": "Negative"
                },
                "Weren't they just telling us to use encrypted messaging apps because China is spying on all of our messages?": {
                    "Sentimental_Value": "Negative"
                },
                "Dark times for privacy, if this “responsible encryption” mantra goes anywhere!": {
                    "Sentimental_Value": "Negative"
                },
                "Why does Forbes constantly run hit pieces on Apple?": {
                    "Sentimental_Value": "Negative"
                },
                "They have tried this before and got butt hurt when Apple wouldn’t play ball. Apple refused to help law enforcement unlock iPhones they wanted access to. Apple won that battle. Hopefully they stick to their guns and keep user privacy a top priority.": {
                    "Sentimental_Value": "Negative"
                },
                "Funny how they’re pretending to care about child sexual abuse when they really just want to read everyone’s data. They don’t seem to care about murder or drug trafficking, but csa is the ultimate evil and we have to give up our privacy. This shit just started in the last few years and I’ve seen it everywhere in politics. It’s so fucking transparent": {
                    "Sentimental_Value": "Negative"
                },
                "If Apple’s iOS security is annoying the FBI, then good on Apple.\n\nKeep up the good work.": {
                    "Sentimental_Value": "Positive"
                },
                "Tell me again why the Apple ecosystem is so bad and android is so superior?": {
                    "Sentimental_Value": "Negative"
                },
                "Who in there right mind trust the FBI with anything especially an encryption key.": {
                    "Sentimental_Value": "Negative"
                },
                "Typical dog and pony show. The govt has had full access to all of our phones for decades but just needs to put on a fascade to dupe the stupid criminals.": {
                    "Sentimental_Value": "Neutral"
                },
                "The timing for this nicely coincides with Cheeto Benito coming into power.\n\nSay goodbye to your privacy boys.": {
                    "Sentimental_Value": "Neutral"
                },
                "Coming right after the story about how China has accessed massive amounts of US telecommunications data via the mechanisms created to give US law enforcement agencies access.  Not great timing.": {
                    "Sentimental_Value": "Negative"
                },
                "\"Responsibly managed encryption\" oh, you mean encryption that you hold the key to and can do whatever you want with? A key that can easily be leaked? A key that will also increase vulnerabilities from hackers? Hell no.\n\nThis article makes it sound like Apple is having a bad time this week, because the FBI is knocking on their door, but it's entirely the opposite. Apple is fighting tooth and nail against ANY and ALL law enforcement agencies and governments getting control of user data. It's a bad time for those agencies and governments, but for Apple and their customer-base? This is amazing news. A for-profit company doing good stuff to protect user privacy? In an economy built on selling as much information about your customers as possible? That's a damn good job from Apple.\n\nThis is just the latest in the FBI's attempts at forcing Apple to make a backdoor for them into their operating systems. They first tried the legal way, but found that Apple broke no laws. Then they tried to drag their name through the mud as being anti-USA, anti-patriotic, and helping terrorists, but that didn't work. Now they're trying to blame Apple for CSAM.\n\nI'm fine with Apple providing information in court cases where there is legal reason and basis for them to do so, with a signed court order where all due process and careful considerations have been made to protect any and all potentially affected users. That's perfectly fine with me. What I'm not okay with is any law enforcement agency being able to just unlock my stuff and check all my private information and data, because of some made up accusations or suspicions.": {
                    "Sentimental_Value": "Negative"
                },
                "I like how they describe iPhones and iOS as “defectively designed”… because the security’s _too_ good.": {
                    "Sentimental_Value": "Negative"
                },
                "Add “no Forbes articles” to the sub rules.": {
                    "Sentimental_Value": "Positive"
                },
                "Apple’s stock has been going up and up, oh what terrible news this is for Apple. How dare they not have a special function to let the FBI rummage around on their customers’ devices to phish potentially incriminating content. And if ya disagree you must hate children. This article is either written so well as to say what they actually mean by so ridiculously stating the obvious, or the FBI wrote this themselves and they need to hurry up and finish middle school.": {
                    "Sentimental_Value": "Negative"
                },
                "**encryption puts users at risk**\n\nLololololololololol. \n\nThese MF's want to jack into your Apple accounts and read all yer shit and snoop for criminal anything. With Kash Patel potentially running the FBI, this is some really scary shit folks. \n\nThey will use child porno as a guilt trap to rationalize and legitimize their lawsuit against apples encryption. Truth be told they already know who the child pornographers are. They all are hanging out at the White House now.": {
                    "Sentimental_Value": "Negative"
                },
                "Aww the fbi wants a back door. I can only imagine how many android has.": {
                    "Sentimental_Value": "Negative"
                },
                "“law enforcement supports strong, responsibly managed encryption. This encryption should be designed to protect people’s privacy and also managed so U.S. tech companies can provide readable content in response to a lawful court order.”\n\nCompanies should be required to turn over what they have, but they shouldn’t be mandated into making it convenient. Especially at the cost of making their product objectively less safe. I agree that CSAM is an issue, but they should handle that client-side before it’s encrypted and reaches icloud in a way that maintains everyone’s privacy. A backdoor into any system has and always will be a bad idea.": {
                    "Sentimental_Value": "Negative"
                },
                "It’s not a defect that you can’t access my phone.  \n\nGFY.": {
                    "Sentimental_Value": "Neutral"
                },
                "The FBI is starting to sound like the CCP.": {
                    "Sentimental_Value": "Negative"
                },
                ">According to the filing lawyers, the class action is “on behalf of thousands of survivors of child sexual abuse for \\[Apple\\] knowingly allowing the storage of images and videos documenting their abuse on iCloud and the company’s defectively designed products. The lawsuit alleges that Apple has known about this content for years, but has refused to act to detect or remove it, despite developing advanced technology to do so.”\n\n>The claims relate to Apple’s proposal to scan on-device imagery for known child sexual abuse material (CSAM) before its upload to iCloud, using hashes of known images to flag matches on phones for manual review. An unsurprising backlash followed, and Apple withdrew its proposal before it was ever released.": {
                    "Sentimental_Value": "Negative"
                },
                "oh yeah... the old \"Put a backdoor because of what people MAY do\" reasoning....\n\nwow": {
                    "Sentimental_Value": "Positive"
                },
                "The article is obviously written by a bootlicker.  The FBI or really, ANY law enforcement is NOT entitled to your encrypted data.  FULL STOP.  This \"think if the children\" line is utter bullshit...as if they REALLY cared about protecting children, the Republicans would prosecute the child molesters/human traffickers in Congress!": {
                    "Sentimental_Value": "Negative"
                },
                "I’m so tired of this. Using children as an excuse to be able to spy on all people using an iPhone. Just insanity.": {
                    "Sentimental_Value": "Negative"
                },
                "After the police back door into the phone system has been revealed to have been in use by the Chinese for years you’d think we would demand not to have back doors. I’m sure it will work fine this time.": {
                    "Sentimental_Value": "Neutral"
                },
                "“Think of the children” they say when trying to strong arm Apple. \n\nMeanwhile school shootings:": {
                    "Sentimental_Value": "Negative"
                },
                "lol “we recommend using only encrypted communications because the Chinese have infiltrated through the telecom back door we mandated for government access and we do not recommend using this defective iOS because it is encrypted without any back door for government access”": {
                    "Sentimental_Value": "Negative"
                },
                "The FBI doesn't like your right to privacy.": {
                    "Sentimental_Value": "Negative"
                },
                "There's no way Law Enforcement would ever misuse encryption back doors. /s": {
                    "Sentimental_Value": "Positive"
                },
                "This excuse of monitoring for csam is a bullshit guilt trip. \"SoMeOne PlEaSe tHiNk oF tHe chILDReN!\" It's not about the children and it never was.": {
                    "Sentimental_Value": "Negative"
                }
            }
        },
        "Google, Apple, and Microsoft are facing anti trust threats ": {
            "Post_Info": {
                "Title": "Google, Apple, and Microsoft are facing anti trust threats ",
                "Score": 84,
                "Comments": 75,
                "Created": "2024-11-28 03:23:41",
                "Subreddit": "stocks",
                "Author": "stockmarkettrader",
                "URL": "https://www.reddit.com/r/stocks/comments/1h1rfit/google_apple_and_microsoft_are_facing_anti_trust/",
                "Content": "At some point do these companies momentum of growing free cash flow exponentially slow down with the looming regulatory attacks? \n\nI’m hedging with Berkshire Hathaway, but I wonder how everyone else protects their portfolios? "
            },
            "Comments": {
                "When everybody is facing antitrust threats, nobody is. Nobody has an advantage": {
                    "Sentimental_Value": "Negative"
                },
                "Yeah no surprise, no anti trust with Tesla and X. It’s all clear there LOL": {
                    "Sentimental_Value": "Positive"
                },
                "For two more months 😂": {
                    "Sentimental_Value": "Positive"
                },
                "Curious how you think Berkshire is a hedge. They hold a lot of cash right now but the stock price certainly won't act like cash in a bear market.": {
                    "Sentimental_Value": "Negative"
                },
                "Unless those regulations greatly affect their bottom line, it’s a non-issue.": {
                    "Sentimental_Value": "Neutral"
                },
                "Might as well appoint Elon Must to be the judge.": {
                    "Sentimental_Value": "Negative"
                },
                "What is Microsoft facing?": {
                    "Sentimental_Value": "Negative"
                },
                "Means it's fine to buy": {
                    "Sentimental_Value": "Positive"
                },
                "Never ever believe in the anti trust threats\n\nJust ignore them": {
                    "Sentimental_Value": "Negative"
                },
                "I'm biased but I believe this is a big nothingburg. Hoping goog will be $200+ by feb": {
                    "Sentimental_Value": "Positive"
                },
                "There is only one resolution if they really think Google has a search monopoly.   \n\nJust have a screen on every device the first time you turn on that asks your preferred search engine from a random list.\n\nThat is the obvious resolution.  Not Google giving up Chrome which is just stupid.\n\nI think they do not want to do this because it would really hurt Apple.\n\nBTW, I personally do NOT believe Google has a monopoly.  They won the space by providing a superior product.\n\nOn every single machine I use Google I could use Bing.  I just do not because Bing is pretty bad compared to Google.  Specially for anything that just recently happened.  Like your Fantasy Basketball player just got hurt.  Google will have in minutes and Bing it will take hours.": {
                    "Sentimental_Value": "Negative"
                },
                "I own all three, long on all": {
                    "Sentimental_Value": "Neutral"
                },
                "What is about Microsoft? Did i miss something about them facing anti trust recently?": {
                    "Sentimental_Value": "Negative"
                },
                "Nothing is going to happen come January.": {
                    "Sentimental_Value": "Negative"
                },
                "New administration, less regulations.  Im pretty confident all this goes away by Feb/March of next year if not the last week of Jan.": {
                    "Sentimental_Value": "Positive"
                },
                "Correction.  They were facing anti-trust threats.  With the new administration, I doubt they will going forward.": {
                    "Sentimental_Value": "Negative"
                },
                "You're not hedging anything with Berkshire. You're doubling down on Apple, and if markets correct, so will Berkshire.": {
                    "Sentimental_Value": "Negative"
                },
                "Yes, trump will stand by and watch a big tech meltdown in market value on his presidency. lol the orange man will absolutely tell the DOJ to fuck off.": {
                    "Sentimental_Value": "Neutral"
                },
                "We got at least 4 more years. Don Trumplestein wont let it happen lol. I expect even more M&A activity from all 3": {
                    "Sentimental_Value": "Positive"
                },
                "Amazon next?": {
                    "Sentimental_Value": "Negative"
                }
            }
        },
        "Apple launches its ChatGPT integration with Siri": {
            "Post_Info": {
                "Title": "Apple launches its ChatGPT integration with Siri",
                "Score": 76,
                "Comments": 33,
                "Created": "2024-12-11 08:49:45",
                "Subreddit": "stocks",
                "Author": "Puginator",
                "URL": "https://www.reddit.com/r/stocks/comments/1hbtvan/apple_launches_its_chatgpt_integration_with_siri/",
                "Content": "Apple released updates for its iPhone, iPad and Mac software on Wednesday that include a long-awaited ChatGPT integration with Siri.\n\nThe ChatGPT integration triggers when users ask Siri complicated questions. When Siri is asked a question that Apple’s software identities as better suited for ChatGPT, it asks the user permission to access the OpenAI service. Apple says that it has built in privacy protections into the feature, and that OpenAI won’t store requests. The integration uses OpenAI’s GPT-4o model.\n\nApple users don’t need an OpenAI account to make use of the ChatGPT integration, but users can pay for upgraded versions of ChatGPT through Apple. Users can also access ChatGPT through some text menus.\n\nThe iOS 18.2 release is a critical milestone for Apple, which is relying on Apple Intelligence to lead the iPhone 16 lineup’s marketing campaign. Apple Intelligence is the company’s suite of artificial intelligence features. Apple first announced the ChatGPT integration back in June.\n\nApple released the first part of Apple Intelligence in October. Those features included writing tools that can proofread or rewrite text, a new design for Siri that makes the whole phone screen glow and notification summaries.\n\nThe company says it will release another update to Apple Intelligence next year that includes significant improvements to Siri, including the ability for it to take actions inside of apps.\n\nMany investors believe that as Apple Intelligence adds features, it will boost iPhone sales, drive an upgrade cycle and potentially cement Apple as a leader in consumer-oriented AI.\n\nThe integration is also a major victory for OpenAI as it puts its most important product in front of millions of iPhone users. Neither Apple nor OpenAI have disclosed financial terms for the arrangement.\n\nUsers need an iPhone 15, iPhone 15 Pro or any iPhone 16 model to install and use Apple Intelligence, even though the ChatGPT integration primarily uses cloud servers. Owners of iPhones can turn on software updates in the General section of the Settings app.\n\nAfter updating to the latest Apple software, users who have not yet activated Apple Intelligence can sign up for a waitlist inside the settings app. Users typically receive access to the software within the same day. Their phones will need to download large files, including Apple’s AI models, that the service needs to operate.\n\nThe Wednesday updates also include Apple’s image generating app, called Playground, which can create images based on people or prompts, and Image Wand, a feature that allows users to remove objects or flaws from photographs.\n\nSource: [https://www.cnbc.com/2024/12/11/apple-launches-its-chatgpt-integration-with-siri.html](https://www.cnbc.com/2024/12/11/apple-launches-its-chatgpt-integration-with-siri.html)"
            },
            "Comments": {
                "*\"The company says it will release another update to Apple Intelligence next year that includes significant improvements to Siri\"*  \nThat should have been done 6 months ago...": {
                    "Sentimental_Value": "Negative"
                },
                "Okay, why can’t I have it on a 13 pro again? It’s not running on the phone, it’s chat gpt": {
                    "Sentimental_Value": "Negative"
                },
                "Yawn": {
                    "Sentimental_Value": "Positive"
                },
                "Honestly, its ok, at best. I have used it for a little and although it is better than previous Siri. It is not what it still should be. I think even if ChatGPT completely replaced Siri, it wouldn’t be as good as you would think. Only time will tell": {
                    "Sentimental_Value": "Neutral"
                },
                "Google has completely taken the thunder today with their Gemini release.\n\nGemini 2.0 Flash is just amazing.  But at the same time going to cost a small fraction to run compared to the other models.  Not just because of the TPUs but because it is a Flash model.": {
                    "Sentimental_Value": "Positive"
                },
                "siri sucks.": {
                    "Sentimental_Value": "Negative"
                },
                "And still can’t tell you the weather or do simple math the like it could in version 16 and before. 17 and 18 are a disaster. ": {
                    "Sentimental_Value": "Negative"
                },
                "Don’t see it on mine": {
                    "Sentimental_Value": "Neutral"
                },
                "it was up and now it's down while everything is still up.": {
                    "Sentimental_Value": "Negative"
                },
                "I’ve been waiting so long for this": {
                    "Sentimental_Value": "Positive"
                },
                "Apple is so far behind in the AI game. Almost embarrassing for a company its size.": {
                    "Sentimental_Value": "Negative"
                },
                "ugh": {
                    "Sentimental_Value": "Negative"
                },
                "Excited for this": {
                    "Sentimental_Value": "Positive"
                }
            }
        }
    },
    "Microsoft": {
        "Microsoft now allowing Windows 11 on older, incompatible PCs": {
            "Post_Info": {
                "Title": "Microsoft now allowing Windows 11 on older, incompatible PCs",
                "Score": 855,
                "Comments": 236,
                "Created": "2024-12-09 15:14:07",
                "Subreddit": "technology",
                "Author": "Apart_Ad_5993",
                "URL": "https://www.pcworld.com/article/2550265/microsoft-now-allowing-windows-11-on-older-incompatible-pcs.html",
                "Content": ""
            },
            "Comments": {
                "They sure walked that back fast.  Probably got a little more negative press than they expected.  I also saw something that said Win 11 market share is losing ground to Win 10 even with all the huff and puff about Win 11 not getting security updates on unsupported hardware. But I wouldn't expect this to be set in stone.  They could and likely will change the plan later.": {
                    "Sentimental_Value": "Negative"
                },
                ">If you proceed with installing Windows 11, your PC will no longer be supported and won’t be entitled to receive updates.\n\nWhy upgrade if I won't receive security updates anyway?\n\n>After installing Windows 11 [...] you’ll see a watermark added to the desktop and you’ll see a notification in the Settings app. These can only be removed with registry tweaks.\n\nTo sum it up: They didn't do batshit and this is the final announcement that they won't do batshit in the future": {
                    "Sentimental_Value": "Negative"
                },
                "Its Microsoft issuing a warning why you should not do it, it is not giving you permission to do it.\n\nBottom line: Do it at your own risk.": {
                    "Sentimental_Value": "Negative"
                },
                "Letting people install it without tech support, no guarantee of security updates, and threatening to void warranties seems pretty passive aggressive. Like they might as well have said…\n\n“Ugh, FINE. Install it on your janky-ass old computer if you insist. Hope you enjoy staring at this watermark on your desktop reminding you that you’re a cheap ass every day of your life. Don’t come whining to us when shit doesn’t work the way you want it to or your shit gets hacked. Let us know when you decide to upgrade to a REAL computer. 😒”": {
                    "Sentimental_Value": "Neutral"
                },
                "When Windows 12 comes, my 5 year old CPU will probably be out of the club.": {
                    "Sentimental_Value": "Positive"
                },
                "Microsoft could make a great OS but instead they choose to use it as a platform for ALL their other services. And I could be ok with that but the hamfisted way they try to *encourage* me to adopt their services results in Windows 11 being effectively nothing but nagware.\n\nAnd the crazy part is, I use some Microsoft services. But that doesn't matter unless I use every. single. one. the way Microsoft wants me to...\n\nEvery machine that runs windows 10 should be able to run windows 11.": {
                    "Sentimental_Value": "Negative"
                },
                "too late, they made me switch to linux after an unrecoverable bsod.": {
                    "Sentimental_Value": "Negative"
                },
                "\"Allowing\" on \"incompatible\" hardware means it was never incompatible in the first place.  \n\n\nJust $$$ generating bullshit forced obsolescence.": {
                    "Sentimental_Value": "Negative"
                },
                "They can allow it all they want, but they better not auto push it. Do not want that terrible OS.": {
                    "Sentimental_Value": "Negative"
                },
                "They don’t know what they want. I kicked Windows to the curb on Friday. Let’s make arbitrary rules and block a whole bunch of perfectly fine machines, oh wait, it’s fine now guys! \n\nI’m done, I tried 11, dont care for it, plus all the ads. Windows 10 was fine. But that’s a thing of the past for me now.": {
                    "Sentimental_Value": "Negative"
                },
                "Ok, so somebody’s gotta tell me if I’m wrong on tires one and I’m serious. \n\nDidn’t Microsoft LITERALLY just within the past week or so triple down on the exact opposite? I remember watching or reading just that. \n\nDoesn’t matter though. Installing linux on my brother’s family’s pcs is gonna happen regardless.": {
                    "Sentimental_Value": "Negative"
                },
                "Why isn't it compatible with devices that aren't actually that old?\nAll it looks like is a cash grab from Microsoft to try to force people to go out and buy new devices, because their works perfectly fine and can run any Windows  os up to 10 device, suddenly can't support 11 due to compatibility issues created by Microsoft.\nYou're not telling me  they couldn't make an os that didn't have these issues.": {
                    "Sentimental_Value": "Negative"
                },
                "I see the exact same thing as last week. Am I missing something?": {
                    "Sentimental_Value": "Negative"
                },
                "Microsoft now ~~allowing~~ **forcing**  Windows 11 on older, incompatible PCs. Fixed it for you": {
                    "Sentimental_Value": "Negative"
                },
                "So, as of now, I could walk over to my 2014 Toshiba/IBM Sure POS system, with an i7 2600k, and just slap Windows 11 on it with no issue currently?\n\nEDIT: It's weird, it has four RAM slots, yet it won't accept four 8GB DDR3 modules. It will happily accept 3 for 24GB. All four slots work, because it definitely works with four 4 GB sticks. I have oodles of DDR3 sticks.": {
                    "Sentimental_Value": "Neutral"
                },
                "So what about all these companies with dated hardware? MS is looking to create the largest e-waste event in history. Won't this sour millions of companies on their OS? For most of my work I can switch to a Linux distro and be fine but so many places don't have that luxury.": {
                    "Sentimental_Value": "Negative"
                },
                "Oh look, windows 11 always worked on older hardware. \n\nYou dont need secure boot and all that nonsense to run win11. Never did, only thing you needed was to use unattend.xml with 4 lines added to bypass that.\n\nOnly anoying thing about windows 11, which is easy to fix with a little tweak is the right click menu to have the win10 apearance.\n\nOtherwise win11 is far better than windows 10, specially if you use a ultrawide monitor.\n\nNot saying i love windows 11. Would rather run linux and windows in a VM with hardware passtrough for games. But to lazy to set that up.": {
                    "Sentimental_Value": "Negative"
                },
                "Too late guys. You lost me shoving AI down my throat. Went to linux and not coming back.": {
                    "Sentimental_Value": "Negative"
                },
                "I quit using my 2 windows 10 laptops because they weren't supported, switched to 2 chrome books and don't miss M$ one bit": {
                    "Sentimental_Value": "Positive"
                },
                "After setting up an Laptop for someone with Win11 for the first time lately. Yeah no, that unfinished DLC can stay away, that was quite annoying.\n\n\nLike I was setting up the laptop for an old person that never really used computers in German, so far so good, worked. But some niche errors messages still show up in fucking English wtf is this bullshit, they can't read that... You had YEARS worth of time now fixing this, that shouldn't be hard": {
                    "Sentimental_Value": "Negative"
                }
            }
        },
        "Microsoft discontinues lackadaisically updated Surface Studio all-in-one desktop": {
            "Post_Info": {
                "Title": "Microsoft discontinues lackadaisically updated Surface Studio all-in-one desktop",
                "Score": 1610,
                "Comments": 272,
                "Created": "2024-12-08 09:15:10",
                "Subreddit": "gadgets",
                "Author": "Sariel007",
                "URL": "https://arstechnica.com/gadgets/2024/12/microsoft-discontinues-lackadaisically-updated-surface-studio-all-in-one-desktop/",
                "Content": ""
            },
            "Comments": {
                "People won't buy a product that lacks long-term support and broad appeal ↔ Company won't provide long-term support and broaden the product line because people won't buy it": {
                    "Sentimental_Value": "Negative"
                },
                "Microsoft doesn’t finish anything they start.": {
                    "Sentimental_Value": "Negative"
                },
                "$4300 for a Windows PC? Someone tell them that even Apple starts its all-in-ones at less than half that": {
                    "Sentimental_Value": "Negative"
                },
                "Yea I’m going to be very selective about my my next laptop and I’m leaning towards a Mac. Apple seems to give great extended support vs windows who constantly tries to get you to upgrade machines that work": {
                    "Sentimental_Value": "Negative"
                },
                "The Zune of all-in-one’s.": {
                    "Sentimental_Value": "Positive"
                },
                "Didn't they promise a standalone Surface Studio display a long time ago? I guess that never came to be..": {
                    "Sentimental_Value": "Negative"
                },
                "I was one of the first people to receive a Surface RT tablet from Sinofsky himself, no less. I was #13 in the country to receive an Xbox One during The NY Times Square launch event… \n\nI now use Mac exclusively. That’s how bad Microsoft is doing as of late and it’s heartbreaking.": {
                    "Sentimental_Value": "Negative"
                },
                "TIL I've been mispronouncing \"lackadaisical.\"\n\nI'm glad I learned a new thing, but I'm pretty disappointed in myself.": {
                    "Sentimental_Value": "Negative"
                },
                "Dude this was a great all in one. wtf Microsoft?!?!? \nThis would’ve been a great niche product for the digital art and video makers.\n\nCouple that with  low cost version and you’d be printing money. 😭": {
                    "Sentimental_Value": "Negative"
                },
                "I hate this so fucking much. \n\nIt’s a beautiful display with an awesome stand. But they keep fucking themselves by trying to make it an iMac. \n\niMacs are going out of style and they think they can keep this going?? Once they updated it with a laptop CPU, a graphics card that was years old at the time and bad when it came out, at like $3-4k. \n\nI gave up.": {
                    "Sentimental_Value": "Neutral"
                },
                "Microsoft once again running ads for Linux lmfao": {
                    "Sentimental_Value": "Negative"
                },
                "Oooooo": {
                    "Sentimental_Value": "Positive"
                },
                "£4700 for an 11th gen i7 and a laptop grade GPU with a nice screen, that probably has zero repair-ability. Can't imagine why people weren't queuing round the block for that.": {
                    "Sentimental_Value": "Positive"
                },
                "I thought the surface studio was an amazing computer for graphics designer or artists or doodlers. But it was so under powered and didn’t allow any upgrades to its computer. Wished they did a Stand alone display.": {
                    "Sentimental_Value": "Neutral"
                },
                "But how will I update my zune now?": {
                    "Sentimental_Value": "Negative"
                },
                "I love the concept of this device but it really should have just been a monitor.": {
                    "Sentimental_Value": "Neutral"
                },
                "This should be (have been) a monitor that works with every pc": {
                    "Sentimental_Value": "Negative"
                },
                "I saw one at a store, it was 4 grand.\n\nThere's unrealistic, there's completely batshit insane and there's Microsoft.": {
                    "Sentimental_Value": "Neutral"
                },
                "Now what will the NFL use to watch live tape back with?": {
                    "Sentimental_Value": "Negative"
                },
                "They made the surface studio to compete with Wacom but made a tablet that wasn't as good and failed\n\nThey made the surface to compete with the iPad but made a tablet that wasn't as good and the software didn't really support it and it failed.\n\nMSFT doesn't know how to make products.": {
                    "Sentimental_Value": "Negative"
                }
            }
        },
        "Microsoft Discontinues iMac Rival Surface Studio 2 Plus | Marking the end of the company's only direct competitor to Apple's iMac, leaving a gap in the Windows ecosystem for high-end all-in-one PCs.": {
            "Post_Info": {
                "Title": "Microsoft Discontinues iMac Rival Surface Studio 2 Plus | Marking the end of the company's only direct competitor to Apple's iMac, leaving a gap in the Windows ecosystem for high-end all-in-one PCs.",
                "Score": 600,
                "Comments": 131,
                "Created": "2024-12-06 09:40:57",
                "Subreddit": "gadgets",
                "Author": "chrisdh79",
                "URL": "https://www.macrumors.com/2024/12/06/microsoft-discontinues-imac-rival-surface-studio/",
                "Content": ""
            },
            "Comments": {
                "It's always weird to me that MSFT will dip its toe into the consumer market just to take it out again over and over\n\nEspecially with hardware \n\nNext to die will be Xbox hardware": {
                    "Sentimental_Value": "Negative"
                },
                "Microsoft and Google are competing who can cancel the most products.": {
                    "Sentimental_Value": "Negative"
                },
                "It’s the same formula over and over: ignore all the reasons Apple didn’t make a product like that, argue endlessly that this is exactly what most people want based on a fringe focus group, release it and fail and cancel the whole thing rapidly.\n\nAt some point, MS will wake up to the reasoning Apple uses to avoid having to constantly drop product categories rapidly.  You need enough users who can afford it, who want it, and who would benefit from it.\n\nEven though it looked pretty cool even to me as a product.\nNot remotely an IMac competitor, though. And the problem is their os is terribly not touch optimized so it loses a lot of the benefits of being touch screen.": {
                    "Sentimental_Value": "Neutral"
                },
                "It's a shame; it's a beautiful product that had some unique and interesting features, but it's kind of plagued by Microsoft not *really* being a hardware company first.\n\nI hope that Microsoft in the future uses that brilliant hinge and display, hopefully in a standalone product. The iMac also suffers from the problem of having an absolutely beautiful frame and display being tied to a specific set of hardware. It just doesn't make much sense for most people, where the display will far outlast the computer it's attached to. \n\nThis is compounded by the fact that it's tied to x86/amd64. Something like this with an M-series chip in it would be a lot more compelling. It being decoupled entirely from a computer would be even better.": {
                    "Sentimental_Value": "Negative"
                },
                "It’s crazy how all these surface products were released is because of how OEMs gave Windows a shitty reputation. Bloatware, default programs being incredibly scammy or asking for money, slow experience, underpowered, etc.\n\nWith Microsoft killing off products left and right, I feel like we’re slowly going to go back to OEM nightmare.": {
                    "Sentimental_Value": "Negative"
                },
                "That's a shame, even as a Mac user, I fell in love with it in the initial reveal advert and a play in a Microsoft shop showed that it was a really useful way of working on large drawings that seemed so obvious in retrospect. But it badly needed updating with better hardware to make it competitive. \n\nMind you, despite the M4 refresh, Apple seems to be quietly killing off the iMac which is the closest alternative, still new no 27\" machine or Pro version, so perhaps this big screen, sort of all-in-one doesn't have a market.": {
                    "Sentimental_Value": "Negative"
                },
                "Not sure if the last part of the title is accurate. There are some pretty pricey all-in-one PCs from other manufacturers.": {
                    "Sentimental_Value": "Negative"
                },
                "All in one PCs are terrible. It's the worst of all worlds in a single piece of hardware. You get a monitor that would be useful far longer than the computer, but you can't use it as a monitor for any other PC. You get shitty laptop hardware packed into a tiny case on the back of the monitor, usually little or no upgrade options available, but its still a desktop machine, not really portable at all. The market for these is almost exclusively rich people who buy this stuff as throwaway items and people who don't know a fucking thing about computers at all, but like the nice single unit packaging.\n\nI would never recommend one of these to anyone for any use case. No one that would ask me about this stuff is rich enough to buy throwaway hardware.": {
                    "Sentimental_Value": "Negative"
                },
                "They love abandoning products they just released.": {
                    "Sentimental_Value": "Negative"
                },
                "Was this the one that had that awesome Willy Wonka reimagined song “world of imagination”? That machine looked awesome (at least from that advert)": {
                    "Sentimental_Value": "Positive"
                },
                "Except it was never a real competitor to the iMac. It was an interesting piece of hardware, but it was a very niche product that priced itself out of the market. I'd be very curious to see just how low the sales numbers were.": {
                    "Sentimental_Value": "Negative"
                },
                "I wish Apple had a standalone iMac that I could draw on with the same feel as the iPad Pro my office of all Mac users would love it.": {
                    "Sentimental_Value": "Positive"
                },
                "Great concept, poor execution, IMO. I love the simplicity and idea of an all in one computer with touchscreen, but hate how the hardware was always far behind current hardware": {
                    "Sentimental_Value": "Positive"
                },
                "Microsoft's hardware is just bad, even their legendary mouse and keyboards are not as they used to be, competition is much better for the same price or less.": {
                    "Sentimental_Value": "Negative"
                },
                "Microsoft mistake is trying to compete with Apple on price thinking consumers care about tech. If they buy apple, they dont care about tech. Its brand. Microsoft would do better by creating midrange tech like the GPUs. I'm already super excited to see the new arc but back to subject. Surface would have caught one if it was cheaper. I'm using one for work myself and its the most amazing thing ever for my line of work. I just can't justify 2100+ on current gen one when a surface 2 RT works just as fine and cost me like 75 bucks.": {
                    "Sentimental_Value": "Negative"
                },
                "It was a fun product but more or less it seemed it was for use to show what windows can do and still can do compared to when the iPad Pro came out and folks migrating to that ecosystem for artists who draw and do creative work. Branded as an AIO it was always a product to be sold at a loss, but kept folks from migrating to MacOS.": {
                    "Sentimental_Value": "Negative"
                },
                "It hurts to see Microsoft’s recent fall from grace. 2019 was the last year I truly remember MS at its finest. They had the most beautiful laptops and desktops. Their extended warranties were generous and hassle-free. The MS showroom in Tysons Corner, VA was an experience. I would go as far as to recommend people buy their Razer laptops from MS because of the generous warranty they provided. \n\nIt all fell apart during Covid with showroom closures, firing of Panos Panay and abandoning their hardware line-up. Hate to see it.": {
                    "Sentimental_Value": "Negative"
                },
                "Love it if they would sell me it as a monitor. Never seen my wife so excited for a piece of tech as when she messed with a surface studio but wasn't going to spend money on the first one and didn't know about the rest.": {
                    "Sentimental_Value": "Neutral"
                },
                "How long until hardware is gone altogether at MSFT?  They have discontinued more products in the last few years than they currently make.": {
                    "Sentimental_Value": "Negative"
                },
                "It was a cool product but way too expensive.": {
                    "Sentimental_Value": "Negative"
                }
            }
        },
        "Google, Apple, and Microsoft are facing anti trust threats ": {
            "Post_Info": {
                "Title": "Google, Apple, and Microsoft are facing anti trust threats ",
                "Score": 89,
                "Comments": 75,
                "Created": "2024-11-28 03:23:41",
                "Subreddit": "stocks",
                "Author": "stockmarkettrader",
                "URL": "https://www.reddit.com/r/stocks/comments/1h1rfit/google_apple_and_microsoft_are_facing_anti_trust/",
                "Content": "At some point do these companies momentum of growing free cash flow exponentially slow down with the looming regulatory attacks? \n\nI’m hedging with Berkshire Hathaway, but I wonder how everyone else protects their portfolios? "
            },
            "Comments": {
                "When everybody is facing antitrust threats, nobody is. Nobody has an advantage": {
                    "Sentimental_Value": "Negative"
                },
                "Yeah no surprise, no anti trust with Tesla and X. It’s all clear there LOL": {
                    "Sentimental_Value": "Positive"
                },
                "For two more months 😂": {
                    "Sentimental_Value": "Positive"
                },
                "Curious how you think Berkshire is a hedge. They hold a lot of cash right now but the stock price certainly won't act like cash in a bear market.": {
                    "Sentimental_Value": "Negative"
                },
                "Unless those regulations greatly affect their bottom line, it’s a non-issue.": {
                    "Sentimental_Value": "Neutral"
                },
                "Might as well appoint Elon Must to be the judge.": {
                    "Sentimental_Value": "Negative"
                },
                "What is Microsoft facing?": {
                    "Sentimental_Value": "Negative"
                },
                "Means it's fine to buy": {
                    "Sentimental_Value": "Positive"
                },
                "Never ever believe in the anti trust threats\n\nJust ignore them": {
                    "Sentimental_Value": "Negative"
                },
                "I'm biased but I believe this is a big nothingburg. Hoping goog will be $200+ by feb": {
                    "Sentimental_Value": "Positive"
                },
                "There is only one resolution if they really think Google has a search monopoly.   \n\nJust have a screen on every device the first time you turn on that asks your preferred search engine from a random list.\n\nThat is the obvious resolution.  Not Google giving up Chrome which is just stupid.\n\nI think they do not want to do this because it would really hurt Apple.\n\nBTW, I personally do NOT believe Google has a monopoly.  They won the space by providing a superior product.\n\nOn every single machine I use Google I could use Bing.  I just do not because Bing is pretty bad compared to Google.  Specially for anything that just recently happened.  Like your Fantasy Basketball player just got hurt.  Google will have in minutes and Bing it will take hours.": {
                    "Sentimental_Value": "Negative"
                },
                "I own all three, long on all": {
                    "Sentimental_Value": "Neutral"
                },
                "What is about Microsoft? Did i miss something about them facing anti trust recently?": {
                    "Sentimental_Value": "Negative"
                },
                "Nothing is going to happen come January.": {
                    "Sentimental_Value": "Negative"
                },
                "New administration, less regulations.  Im pretty confident all this goes away by Feb/March of next year if not the last week of Jan.": {
                    "Sentimental_Value": "Positive"
                },
                "Correction.  They were facing anti-trust threats.  With the new administration, I doubt they will going forward.": {
                    "Sentimental_Value": "Negative"
                },
                "You're not hedging anything with Berkshire. You're doubling down on Apple, and if markets correct, so will Berkshire.": {
                    "Sentimental_Value": "Negative"
                },
                "Yes, trump will stand by and watch a big tech meltdown in market value on his presidency. lol the orange man will absolutely tell the DOJ to fuck off.": {
                    "Sentimental_Value": "Neutral"
                },
                "We got at least 4 more years. Don Trumplestein wont let it happen lol. I expect even more M&A activity from all 3": {
                    "Sentimental_Value": "Positive"
                },
                "Amazon next?": {
                    "Sentimental_Value": "Negative"
                }
            }
        },
        "If you had to start again today and could only choose five stocks to set you up for the rest of your life, what would they be?": {
            "Post_Info": {
                "Title": "If you had to start again today and could only choose five stocks to set you up for the rest of your life, what would they be?",
                "Score": 260,
                "Comments": 435,
                "Created": "2024-12-08 13:17:36",
                "Subreddit": "stocks",
                "Author": "BlackChef6969",
                "URL": "https://www.reddit.com/r/stocks/comments/1h9oztr/if_you_had_to_start_again_today_and_could_only/",
                "Content": "If you had to start again today and could only choose five stocks to set you up for the rest of your life, what would they be?\n\nImagine you can't do any day trading or chopping and changing. Just five stocks to set you up for the long term.\n\nThe tech and AI ones are obvious, particularly stuff like Amazon, NVIDIA, Microsoft etc. I struggle to think of what would be in my guaranteed top five though."
            },
            "Comments": {
                "If we are actually talking about the rest of my life then I would probably choose something like Coca Cola, McDonalds, Berkshire, Amazon and Google.": {
                    "Sentimental_Value": "Positive"
                },
                "“The tech and AI ones are obvious..”\n\nThis is such a dangerous statement. There is no such thing as a forever investment.": {
                    "Sentimental_Value": "Negative"
                },
                "COST\n\nWSM\n\nMSFT\n\nNVDA\n\nGOOG": {
                    "Sentimental_Value": "Negative"
                },
                "I'm going CP, SPGI, ASML, V, BRK.": {
                    "Sentimental_Value": "Positive"
                },
                "BRK.a (4 of those and your good lol)\n\nMSFT\n\nWM\n\nTSMC\n\nAMZN": {
                    "Sentimental_Value": "Neutral"
                },
                "S&P Global Inc\n\nFair Isaac Corporation\n\nVisa\n\nWalmart\n\nAmazon": {
                    "Sentimental_Value": "Neutral"
                },
                "Brkb amzn, msft": {
                    "Sentimental_Value": "Negative"
                },
                "The flaw in picking stocks for the rest of our lifetimes is we simply can’t see far enough ahead to know what the next generation of disruptors will look like. For that reason, I’d choose a basket of index funds. The funds will change with the times.": {
                    "Sentimental_Value": "Negative"
                },
                "Surprised by the lack of aapl on most lists.": {
                    "Sentimental_Value": "Negative"
                },
                "I wouldn't. I would do the s&p 500.": {
                    "Sentimental_Value": "Neutral"
                },
                "ASTS, IONQ, RKLB, SMR, OKLO": {
                    "Sentimental_Value": "Negative"
                },
                "- XOM: we will always need energy\n- WM: we will always create waste\n- V: we will always transact\n- AMGN: we will always improve our bodies \n- GOOGL: we will always seek information \n\nThese particular companies have also shown they can innovate, change, and adjust to the current landscape. To wit, and not a complete list:\n\n- XOM: has added new energy to the portfolio \n- WM: has expanded into medical waste \n- V: has invested in blockchain\n- AMGN: active acquirer \n- GOOGL: constantly growing as a conglomerate (Search, YouTube, Ads, Productivity, Android, Waymo, capital/venture, etc.)": {
                    "Sentimental_Value": "Neutral"
                },
                "AAPL, Amazon, Microsoft, Berkshire, Costco, TSMC": {
                    "Sentimental_Value": "Positive"
                },
                "I'm going with GOOGL, TSLA, IBKR, APO, and WISE.  \nStrong management is very important for a company's long-term health.": {
                    "Sentimental_Value": "Neutral"
                },
                "Technology and the way we live and work is changing at an ever-fast pace. No companies survive forever - and assuming you can pick any stocks 'for life' is silly. If that is how you think about investing, buy VOO because it's how you invest in etfs. Not single stocks.": {
                    "Sentimental_Value": "Positive"
                },
                "Amzn, meta, google, nvda, msft. Replace apple With any of those. I own all 6 and thay make up the bulk of my stock portfolio,": {
                    "Sentimental_Value": "Negative"
                },
                "GOOG\nMETA\nAMD\nNVIDIA\nTSMC\n\nif I had a pick another it should be\nIONQ(I believe that they could get their chunk in QC)": {
                    "Sentimental_Value": "Negative"
                },
                "Crwd amzn V sofi and Msft": {
                    "Sentimental_Value": "Negative"
                },
                "British American tobacco, Mcdonald, Coca Cola, Walmart, Lockheed Martin. (Yes I'm going to hell but I like profit and stability).": {
                    "Sentimental_Value": "Neutral"
                },
                "COST, AMZN, GOOGL, MSFT, NFLX": {
                    "Sentimental_Value": "Negative"
                }
            }
        },
        "‘My heart is in Amazon’: Jeff Bezos returns to Amazon’s frontlines with a focus on AI": {
            "Post_Info": {
                "Title": "‘My heart is in Amazon’: Jeff Bezos returns to Amazon’s frontlines with a focus on AI",
                "Score": 742,
                "Comments": 109,
                "Created": "2024-12-08 16:35:35",
                "Subreddit": "stocks",
                "Author": "Lunaerus",
                "URL": "https://www.reddit.com/r/stocks/comments/1h9thrg/my_heart_is_in_amazon_jeff_bezos_returns_to/",
                "Content": "“Jeff Bezos, Amazon’s founder and former CEO, has re-emerged as a driving force at the tech giant, dedicating 95% of his time to advancing artificial intelligence initiatives. Speaking at the DealBook Summit on Wednesday, Bezos expressed his enduring connection to the company he founded 30 years ago, even after stepping down as CEO in 2021.\n\n“My heart is in Amazon, my curiosity is in Amazon, and my fears are there, and my love is there,” Bezos said, reinforcing his deep ties to the company and its mission.\n\nBezos’s renewed focus on AI comes as Amazon seeks to assert itself in the rapidly evolving technology landscape. The company is currently developing over 1,000 internal AI applications and aims to leverage this momentum to remain competitive with industry giants like Google, Microsoft, and OpenAI.\n\nOne of the cornerstone projects under Bezos’s watch involves building a cutting-edge supercomputer in partnership with Anthropic, the AI startup in which Amazon recently invested $8 billion. This supercomputer is expected to power a multimodal AI model capable of analysing images, video, and text, further enhancing Amazon’s AI capabilities.\n\nAlthough Bezos stepped down as CEO to focus on his space venture, Blue Origin, he continues to serve as Amazon’s executive chairman, actively supporting CEO Andy Jassy and the leadership team. His involvement mirrors a broader trend of tech founders, such as Google’s Larry Page and Sergey Brin, returning to their companies to steer AI-focused strategies.\n\n“I’ll always be there to help, and right now, I’m putting a lot of time into it,” Bezos said. “It’s super interesting, so why not?”\n\nAmazon’s AI ambitions are supported by significant investments in infrastructure and talent. The company is betting big on the transformative potential of artificial intelligence to enhance its services and operations, positioning itself as a serious contender in the ongoing AI race.\n\nBezos’s hands-on approach signals his commitment to Amazon’s future during this pivotal time in technological innovation. His involvement aligns with the company’s broader goals of integrating AI into various aspects of its operations, from customer service to cloud computing.\n\nBezos’s renewed focus on Amazon coincides with a surge in his net worth, which reached $228 billion last month, according to the Bloomberg Billionaires Index. The increase was driven by Amazon’s stock hitting a record $207.09 per share, boosting Bezos’s wealth by $7 billion as he continues to hold nearly 9% of the company.”\n\nSource: https://www.businesstoday.in/amp/technology/news/story/my-heart-is-in-amazon-jeff-bezos-returns-to-amazons-frontlines-with-a-focus-on-ai-456555-2024-12-07"
            },
            "Comments": {
                "He gotta fight to get richer than elon once more": {
                    "Sentimental_Value": "Positive"
                },
                "Oh, so that's why Bezos is suddenly optimistic about Trump.": {
                    "Sentimental_Value": "Neutral"
                },
                "Amazon’s FCF is absolutely insane. Jassy is gonna Tim Cook this company towards over a decade of 20%+ CAGR. I would not be surprised if they end up #1 in market cap. Also Trump said today he’s agreed to meet Bezos for dinner. Bezos will suck up to get on Trump’s good side which is good for the stock.\n\nBiggest risks are tariffs hurting e-commerce and antitrust but Amazon is diversified and printing enough cash to weather most storms. I think the worst is behind Amazon after they overspent in 2020-21 and got hammered by inflation in 2022. \n\nAI will also help them in so many ways. Fatter margins due to lower headcount, AWS, ad business, etc etc.": {
                    "Sentimental_Value": "Negative"
                },
                "My theory is they will eventually upload Alexa into Optimus and you'll be able to buy a 300-pound paperweight that can tell you the time, weather and jokes.": {
                    "Sentimental_Value": "Positive"
                },
                "Time to re-buy . But lets wait the dip between now and march": {
                    "Sentimental_Value": "Positive"
                },
                "He is bored.": {
                    "Sentimental_Value": "Negative"
                },
                "That DealBook interview was very good. Bezos went into a lot of topics, including how he thinks Blue Origin may end up being a bigger business than Amazon. Andrew Ross Sorkin got him comfortable, which allowed Bezos to delve into his thought process and philosophies - well worth listening to.": {
                    "Sentimental_Value": "Positive"
                },
                "$AMZN will double in 4 yeara": {
                    "Sentimental_Value": "Positive"
                },
                "These corporations are going to be the end of humanity": {
                    "Sentimental_Value": "Negative"
                },
                "Maybe get rid of all the fake reviews first jeff.": {
                    "Sentimental_Value": "Negative"
                },
                "I keep seeing that Amazon is \"trying to catch up\". \n\nWhether true or not, Amazon really has all the tools and management needed to be very successful in AI. They can incorporate it in must about all parts of their business. Whether in their warehouses for efficiencies (which they are already doing and accelerating) or in Advertising, or in 3rd party services, or in Prime Video (for ads I think), or in Cloud or in new things they are playing the long game in, like Project Kuiper. \n\nAlso, even though Bezos is not letting go of Amazon completely, I'm glad there are no stories of issues between Jassy and Bezos. \n\nThink I'll buy more AMZN soon 😅": {
                    "Sentimental_Value": "Positive"
                },
                "\"frontlines\" oh word so is he busting his ass on the warehouse floor without piss breaks?": {
                    "Sentimental_Value": "Neutral"
                },
                "I forget where i heard it but someone said something that made amazon click for me:   \nGoogle is such a good business that everything else looks aweful in comparison which is why they fail to diversify. Amazon's core business on the other hand is so bad, everything else looks like a great idea so they succeed in their other revenue streams.\n\nOf all the big tech companies only 2 really have done a great job diversifying, amazon and microsoft, and of the two amazon's the only one that did it organically.": {
                    "Sentimental_Value": "Negative"
                },
                "is he also RTOing?": {
                    "Sentimental_Value": "Negative"
                },
                "My stock will go up": {
                    "Sentimental_Value": "Negative"
                },
                "Looks like knows blue origin has no future with Elon determining federal space expenditures. Kind of a shame he seemed really passionate about it on Lex Freidman.": {
                    "Sentimental_Value": "Negative"
                },
                "It looks like OP posted an AMP link. These should load faster, but AMP is controversial because of [concerns over privacy and the Open Web](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot).\n\nMaybe check out **the canonical page** instead: **[https://www.businesstoday.in/technology/news/story/my-heart-is-in-amazon-jeff-bezos-returns-to-amazons-frontlines-with-a-focus-on-ai-456555-2024-12-07](https://www.businesstoday.in/technology/news/story/my-heart-is-in-amazon-jeff-bezos-returns-to-amazons-frontlines-with-a-focus-on-ai-456555-2024-12-07)**\n\n*****\n\n ^(I'm a bot | )[^(Why & About)](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot)^( | )[^(Summon: u/AmputatorBot)](https://www.reddit.com/r/AmputatorBot/comments/cchly3/you_can_now_summon_amputatorbot/)": {
                    "Sentimental_Value": "Neutral"
                },
                "He has a heart? I’m shocked…": {
                    "Sentimental_Value": "Neutral"
                },
                "\"My net worth is in Amazon.\"": {
                    "Sentimental_Value": "Negative"
                },
                "Ai is the cool buzzword right now": {
                    "Sentimental_Value": "Positive"
                }
            }
        }
    },
    "Google": {
        "Google steps in after McDonald's gets ‘review bombed’ over arrest in UnitedHealth CEO's murder": {
            "Post_Info": {
                "Title": "Google steps in after McDonald's gets ‘review bombed’ over arrest in UnitedHealth CEO's murder",
                "Score": 28943,
                "Comments": 2127,
                "Created": "2024-12-10 02:01:22",
                "Subreddit": "technology",
                "Author": "wizardofthefuture",
                "URL": "https://www.hindustantimes.com/world-news/google-steps-in-after-mcdonalds-get-review-bombed-over-arrest-in-unitedhealth-ceos-murder-101733809168783.html",
                "Content": ""
            },
            "Comments": {
                "Let’s be real. No one needs to look at reviews for fucking McDonald’s": {
                    "Sentimental_Value": "Positive"
                },
                "Now review bomb Google": {
                    "Sentimental_Value": "Negative"
                },
                "If it was a local burger place, Sundar Pichai wouldn't do the same thing he's doing for Chris Kempczinski...": {
                    "Sentimental_Value": "Neutral"
                },
                "On the one hand, google does have a policy against review bombing. On the other hand; fuck ‘em. \n\nEdit: A lot of people seem to think I’m defending google, I’m not. I’m pointing out that google has a policy about removing reviews like this, so I fully expect them to do that. I also said “fuck ‘em”, which I thought conveyed accurately that I don’t care if this particular McDonalds gets flooded with fake reviews; but apparently reading comprehension is difficult.": {
                    "Sentimental_Value": "Negative"
                },
                "Wasn't it a random customer that reported it anyway?": {
                    "Sentimental_Value": "Neutral"
                },
                "Fk McDonald's anyways. They and Health Insurance are working together making people sick": {
                    "Sentimental_Value": "Negative"
                },
                "They always do. Everytime there's content of some shop or restaurant fucking up and reddit swoops in to review bomb, all bad reviews are gone a week later.": {
                    "Sentimental_Value": "Neutral"
                },
                "[removed]": {
                    "Sentimental_Value": "Negative"
                },
                "You guys are doing it all wrong. You gotta wait a week or two and then review bomb when \"the news cycle has ended\", but you still remember. 😈": {
                    "Sentimental_Value": "Neutral"
                },
                "I was very surprised they specified it was an employee who ratted on him. This Luigi guy (for better or worse) is a folk hero to a lot of people and that puts people there at risk. If I was an employee there I would quit immediately.": {
                    "Sentimental_Value": "Neutral"
                },
                "my family, 30 years later, is still dealing with the financial repercussions of this company.  it didn't start with said ceo, and it wont end with him.\n\ni.  have.  no.  sympathy.  \n\nthey took my brother and told me to fuck off.  ghouls and demons like this will never experience a heartbreak.": {
                    "Sentimental_Value": "Negative"
                },
                "The Kleptocracy is not happy people are speaking out.": {
                    "Sentimental_Value": "Neutral"
                },
                "Boycott the McDonalds where the informant worked, and then shift to boycotting the company altogether. They are making you sick with fat, greasy food, so that health insurance companies can screw you up.": {
                    "Sentimental_Value": "Negative"
                },
                "Fuck review bombing. This is America. If you want a company to listen then you need to stop giving them money": {
                    "Sentimental_Value": "Negative"
                },
                "Funny. I've reported fake reviews posted on my small business page for months now and Google has done nothing about them.\n\nI guess it's also a two-tier system when it comes to removing slander.": {
                    "Sentimental_Value": "Negative"
                },
                "Not on anybody’s side but you guys should know the difference between a franchise and corporate owned": {
                    "Sentimental_Value": "Neutral"
                },
                "Pichai Sundararajan, better known as Sundar Pichai, CEO of Alphabet Inc. and its subsidiary, Google, was reportedly compensated to the tune of $226 million in 2022.\n\nThis, incidentally, is approximately 8,475 times the annual compensation of a McDonald's crew worker.": {
                    "Sentimental_Value": "Neutral"
                },
                "The tiktok content creators all swarming that McDonald’s is cringe af. So desperate": {
                    "Sentimental_Value": "Neutral"
                },
                "He was writing this\n\nLast paragraph was:\n\nThat’s where UnitedHealthcare went wrong. They violated their contract with my mother, with me, and tens of millions of other Americans. This threat to my own health, my family’s health, and the health of our country’s people requires me to respond with an act of war.\n\n[doc](https://archive.is/7jUsF)": {
                    "Sentimental_Value": "Negative"
                },
                "Yes, this always happens when people spam negative reviews.": {
                    "Sentimental_Value": "Negative"
                }
            }
        },
        "Android Police: Google Maps is getting the last thing keeping you on Waze": {
            "Post_Info": {
                "Title": "Android Police: Google Maps is getting the last thing keeping you on Waze",
                "Score": 3410,
                "Comments": 637,
                "Created": "2024-12-02 00:34:00",
                "Subreddit": "technology",
                "Author": "Snowfish52",
                "URL": "https://www.androidpolice.com/google-maps-waze-incident-reports/",
                "Content": ""
            },
            "Comments": {
                "[removed]": {
                    "Sentimental_Value": "Negative"
                },
                "It doesn’t tell me which lane I should be in to take a turn at least once or twice a long trip. Waze does it on every turn. Not switching until then. \n\nAlso, waze feels like it was built by devs and designers passionate about what they were building and the craft of building apps. Google maps feels like a corporate, committee lead app": {
                    "Sentimental_Value": "Negative"
                },
                "Lane assist, better routing, better incident reporting.  There's more than just one thing that Waze has over Google maps": {
                    "Sentimental_Value": "Neutral"
                },
                "Waze has been in full maintenance mode for a while. Google has stop updating the developer sdk and not marketing it at all any more. \n\nThey are planning on killing Waze.": {
                    "Sentimental_Value": "Negative"
                },
                "Here in Alberta, Canada, I've had these new features for a few weeks now. I glanced at my phone and noticed it looked a little odd, and that was because there was some prompt to confirm that police/stalled vehicle were still there. Alas, in my experience, I found that the timer to hit Yes/No was right at the end before I drove near the icon displayed in the map, so I found it pretty useless to participate in unless I was watching it like a hawk.": {
                    "Sentimental_Value": "Neutral"
                },
                "whats point of this article? doesnt google own waze?": {
                    "Sentimental_Value": "Neutral"
                },
                "Does anyone else feel that google maps is spending less compute time finding an optimal route in the last few years? I find it making silly routing decisions especially when recalculating. I find it worse than non cloud devices from the early aughts.": {
                    "Sentimental_Value": "Negative"
                },
                "Maybe about a year ago read about the government working with navigation providers about not providing “rat runs” (faster routes along minor roads). Usually used waze but decided to try google maps and apple maps on my route into London, found that google was the only one that wouldn’t direct me down Liverpool road off the A1 , rejoining the A1 just before the City road usually saves around 10 minutes. \n\nWhat I want off navigation is the faster routes balanced with the simplest (remember when waze used to navigate on just the shortest, when I lived in LA it was useless as it would drop you onto surface streets with no regard to left turns onto major roads or just crossing them taking minutes).": {
                    "Sentimental_Value": "Negative"
                },
                "There's also https://www.magicearth.com/ for people trying to de-google themselves.\n\nBuilt on top of OpenStreetmap.": {
                    "Sentimental_Value": "Negative"
                },
                "Still no \"just drive\" feature though. Why do I need to put in a destination to see my speed and stuff? So annoying.": {
                    "Sentimental_Value": "Negative"
                },
                "People are using Waze over GMaps over this reporting feature? I've had it for a few weeks now and find it to be a generally obnoxious change.": {
                    "Sentimental_Value": "Negative"
                },
                "Used google maps and Waze for years but..\n\nI just love the Apple Maps UI, so clean and visually pleasing. Directions never fail me and they have offline maps now too!": {
                    "Sentimental_Value": "Positive"
                },
                "I'm a Google Maps user (currently) but here's a fucking idea:  will Waze stick to the goddamned route we agree on beforehand instead of randomly giving me a \"no\" button with a five second timer meaning I have to stop looking at the road and poke the satnav which is a) illegal and b) worse, a really bad idea.\n\nThere's a road near me that is in the process of sliding down the hillside and isn't wise to take in bad weather conditions.  To avoid being directed back to it involves babysitting Google Maps constantly, something that I *really don't want to do* while driving.  On three occasions I've turned a corner to find that the fucking app has redirected me back to that same goddamned unsafe road.": {
                    "Sentimental_Value": "Negative"
                },
                "Any love for Apple Maps?  I prefer how it gives directions, for example, ‘Go through this light and turn right at the next one’": {
                    "Sentimental_Value": "Positive"
                },
                "Speed limits? No. Of course not. \n\nEDIT: not everyone lives in the USA": {
                    "Sentimental_Value": "Negative"
                },
                "I miss my Waze with C-3PO’s voice.": {
                    "Sentimental_Value": "Positive"
                },
                "just make the exit numbers bigger on vertical.": {
                    "Sentimental_Value": "Negative"
                },
                "- Google Maps now displays incident reports from the Waze community, showing alerts like “Police reported ahead.”\n- The bottom sheet with the report disappears after a while or can be manually closed, ensuring minimal distraction for drivers.\n- The feature may not be widely available yet, with only a few users reporting its visibility.": {
                    "Sentimental_Value": "Neutral"
                },
                "Can I please get a I know how to get out of town option?\n\nI just need the directions to start after I’m on the highway/main road.": {
                    "Sentimental_Value": "Negative"
                }
            }
        },
        "Google CEO: AI development is finally slowing down—‘the low-hanging fruit is gone’": {
            "Post_Info": {
                "Title": "Google CEO: AI development is finally slowing down—‘the low-hanging fruit is gone’",
                "Score": 2911,
                "Comments": 572,
                "Created": "2024-12-08 21:47:40",
                "Subreddit": "technology",
                "Author": "eunumseioquescrever",
                "URL": "https://www.cnbc.com/2024/12/08/google-ceo-sundar-pichai-ai-development-is-finally-slowing-down.html",
                "Content": ""
            },
            "Comments": {
                "Good. Can you fix search now then?": {
                    "Sentimental_Value": "Negative"
                },
                "Unfortunately I believe he is right, but Sam Altman apparently thinks that progress will instead accelerate, let's see who is correct.": {
                    "Sentimental_Value": "Positive"
                },
                "And that's a good thing.\n\n\nWe are in an optimal state: AI is good enough to increase productivity, but not enough to cause a unemployment cataclysm. \n\n\nI wish we could freeze it like this forever.": {
                    "Sentimental_Value": "Positive"
                },
                "When does the intelligence part kick in?": {
                    "Sentimental_Value": "Neutral"
                },
                "He may or may not be right about how the rapid expansion of the technological advancement is slowing down. I can't speak to that. But more importantly than that is the simple fact that the consumer monetization and corporate utilization have failed to meet the sky-high promises that all these tech company promised. \n\nInstead of revolutionizing life for normal people, the best they can offer is horrible search results and clunky re-writes of emails/docs that no one asked for. Instead of replacing thousands of workers, the best the can offer is piss poor coding that breaks and frustrating customer support \"chats\" that anger customers endlessly.\n\nIt's the same as how 10 years ago tech companies were all promising self driving cars and selling the vision of being able to just type in an address and take a nap while the car drives you there. Once it became obvious the tech was still a decade+ away, the hype fell off for all but the most dyed in the wool fans of the companies/concepts.": {
                    "Sentimental_Value": "Negative"
                },
                "The low hanging fruit in GenAI isn't particularly useful. ": {
                    "Sentimental_Value": "Negative"
                },
                "Well that didnt take long, layoffs were hard and heavy and then its like that was the easy stuff.": {
                    "Sentimental_Value": "Positive"
                },
                "Google CEO: Please let us catch up now!": {
                    "Sentimental_Value": "Neutral"
                },
                "It's barely done anything. Mostly been used as an excuse to fire people and helped students cheat on papers": {
                    "Sentimental_Value": "Neutral"
                },
                "\"Low-hanging fruit\"? \n\nWhere was that?\n\nYou mean the summary AI results that are kind of sort of correct but not necessarily correct that pop up first thing in a Google search?\n\nCan we all just please get over this stupid AI hype and let it play its course in dev labs and beta tester's basements?": {
                    "Sentimental_Value": "Neutral"
                },
                "Reading between the lines -- this is about as good as it is going to get, because language models can only take you so far.": {
                    "Sentimental_Value": "Positive"
                },
                "More likely the push back is growing.  With Microsoft's copilot bring banned from some federal agencies. The FBI releasing PSAs warnings to the public on criminal activity using AI.": {
                    "Sentimental_Value": "Negative"
                },
                "Stealing everyone’s art, writing, and IP to feed your algorithm was the “low-hanging fruit” - gotcha": {
                    "Sentimental_Value": "Positive"
                },
                "I love this new future of hilariously unreal videos of random objects transforming into other objects. Or assistants that confidently spout off wrong information at me while unable to answer basic questions like counting R's in a word. Writing assignments for school are now no longer a viable thing, and we've got AI assistants replacing front line customer service reps while being more useless at helping customers than ever before. I'm glad, every large tech company is now worth trillions and they're all working on giving us more of this.": {
                    "Sentimental_Value": "Positive"
                },
                "Its great that all the enjoyable jobs happened to be the low hanging fruit of AI. I wouldn't want any tedious work to be replaced.": {
                    "Sentimental_Value": "Positive"
                },
                "Sure, for Google it is.  Good for them for trying.": {
                    "Sentimental_Value": "Positive"
                },
                "well they created the perfect AI to deny healthcare claims, which leads to the deaths of poor and middle class Americans. what more do the rich people want?": {
                    "Sentimental_Value": "Negative"
                },
                "Google CEO: Our Gemini is not stupid, just AI development is slowing down 😁": {
                    "Sentimental_Value": "Negative"
                },
                "Now we start the project of removing the broken AI features that have been stuck everywhere": {
                    "Sentimental_Value": "Negative"
                },
                "Nvidia is going to tank hard. They are scrambling right now to diversify, this next year is going to be very interesting for tech stocks as they realize AI has not paid out how they wanted it to.": {
                    "Sentimental_Value": "Positive"
                }
            }
        },
        "Sundar Pichai says Google Search will ‘change profoundly’ in 2025.": {
            "Post_Info": {
                "Title": "Sundar Pichai says Google Search will ‘change profoundly’ in 2025.",
                "Score": 1519,
                "Comments": 539,
                "Created": "2024-12-06 18:26:11",
                "Subreddit": "technology",
                "Author": "Valinaut",
                "URL": "https://www.theverge.com/2024/12/5/24314245/sundar-pichai-google-search-change-profoundly-2025",
                "Content": ""
            },
            "Comments": {
                "\"For the better?\"\n\n\n\"...\"": {
                    "Sentimental_Value": "Negative"
                },
                "Wish we could just have a \"Google Classic\" version to use. It used to feel so intuitive to search for something; now, keywords do fuck all and it seems easier than even for scammy/AI-generated websites to game SEO to pop up as top hits.": {
                    "Sentimental_Value": "Negative"
                },
                "“I think we are going to be able to tackle more complex questions than ever before,” Pichai said.\n\nHow about the question of providing actual web page search results again instead of AI plagiarism, ads, and boxes that restate my queries?\n\nDoesn’t matter. I mostly stopped using Google a few years back anyway. I still check it now and then just to see how cluttered and confusing it’s become.\n\nKind of miss the 10 blue links of yesteryear.": {
                    "Sentimental_Value": "Positive"
                },
                "Are they going to make it fucking usable again?": {
                    "Sentimental_Value": "Negative"
                },
                "Is it just me, or is google search just absolute hot garbage bordering on completely useless?": {
                    "Sentimental_Value": "Negative"
                },
                "All I'm hearing is the entirety of the first page will be sponsored ads and AI overview, and actual, real searches will be on page two or three\n\n\n*spelling": {
                    "Sentimental_Value": "Negative"
                },
                "Enshittification": {
                    "Sentimental_Value": "Positive"
                },
                "I don't think so. Its been a downward spiral for ages": {
                    "Sentimental_Value": "Negative"
                },
                "Yes Pichai they(Microsoft) are using 'someone else's models\". And their models are better than your models.\n\nGoogle search just isn't what is used to be. I feel like I'm fighting against it to show me relevant results which isn't how a search engine is supposed to work lol.": {
                    "Sentimental_Value": "Negative"
                },
                "Hoping that it just doesn’t load up a bunch of sponsored links…": {
                    "Sentimental_Value": "Negative"
                },
                "It would be cool if Google search was actually functional again. Get rid of promoted results. Allow people to discover stuff instead of burying it under mountains of shit.": {
                    "Sentimental_Value": "Negative"
                },
                "dear google ceo- if i wanted to query an LLM I would be querying an LLM": {
                    "Sentimental_Value": "Negative"
                },
                "True. Now your searches will just link directly to Reddit.": {
                    "Sentimental_Value": "Neutral"
                },
                "He may be a Wall Street darling, but Sundar Pichai is one of, if not the most, worthless CEOs in tech. Dude has done a whole bunch of *nothing*. He has no vision and no ideas. Everything he has done has been anti-consumer or anti-worker and has been for the worse. Hell, they had what, a ten year head start on AI, only to be caught on their heels and beaten to market by a company no one had even heard of. \n\nThis man took over one of the most revolutionary and innovative tech companies in history and effectively neutered it. They don’t take chances anymore. They aren’t industry leaders. They don’t innovate. No one is waiting or watching for what Google is going to do—*in any space*. They are not nearly as important or relevant as they used to be.": {
                    "Sentimental_Value": "Negative"
                },
                "They messed with it so much I switched to duck-duck-go, screw Google.": {
                    "Sentimental_Value": "Negative"
                },
                "Nobody wants this stupid AI horseshit.": {
                    "Sentimental_Value": "Negative"
                },
                "Not gonna lie, I'm using Bing and enjoying it more. Feels like I'm able to see too many aspects of a search, sometimes it doesn't exactly give me what I want yes, or maybe I need an alternative search engine for more results that I think I'm missing something, then I use Google. But right now I'm literally using Bing that we've made jokes about it, because of Google.": {
                    "Sentimental_Value": "Positive"
                },
                "I've already switched to Bing.  I wouldn't say it is much better but fuck google for enshitifying their search engine to the point where it is no longer clearly better than bing.": {
                    "Sentimental_Value": "Negative"
                },
                "Google search sucks.  I don't know how anyone can use it.  It's nothing but adds and sponsored links.  When you finally find real results, they're so over 'optimized' that they're useless.": {
                    "Sentimental_Value": "Negative"
                },
                "To stop giving garbage results again? Because you know that would be nice if it started working as a search engine again instead of feeding spammed sponsored trash": {
                    "Sentimental_Value": "Positive"
                }
            }
        },
        "Google shares rise on new quantum chip breakthrough": {
            "Post_Info": {
                "Title": "Google shares rise on new quantum chip breakthrough",
                "Score": 480,
                "Comments": 186,
                "Created": "2024-12-10 09:42:37",
                "Subreddit": "stocks",
                "Author": "Guy_PCS",
                "URL": "https://www.reddit.com/r/stocks/comments/1hb39my/google_shares_rise_on_new_quantum_chip/",
                "Content": "\n\nShares of Google (NASDAQ:GOOGL) saw a 4% increase in pre-open trading Tuesday, reflecting investor confidence following the company's unveiling of its new quantum computing chip, Willow. Sundar Pichai, CEO of Google, introduced the chip on Monday, highlighting its ability to significantly reduce computational errors and its performance in benchmark tests.\n\nPichai emphasized the chip's potential in practical applications, stating, \"We see Willow as an important step in our journey to build a useful quantum computer with practical applications in areas like drug discovery, fusion energy, battery design + more.\"\n\nThe new chip, according to Pichai, has achieved two major milestones. It can exponentially decrease errors with the addition of more qubits, addressing a quantum error correction challenge that has persisted for nearly three decades. In addition, Willow completed a standard benchmark computation in less than five minutes, a task that would take one of the fastest supercomputers today more than 10 septillion years.\nThis development is part of Google's long-term commitment to quantum computing, a vision that began over a decade ago when Pichai founded Google Quantum (NASDAQ:QMCO) AI in 2012. \n\nThe goal is to build a quantum computer that leverages quantum mechanics to advance scientific discovery and address societal challenges.\n\nThe announcement drew a simple yet telling reaction from Tesla (NASDAQ:TSLA) CEO Elon Musk, who expressed his astonishment with a single word, \"wow,\" on social media platform X.\n\nThe Willow chip represents a significant advancement for Google Quantum AI and positions the company closer to achieving commercially viable quantum computing applications."
            },
            "Comments": {
                "Finally my year long crusade on here schilling Google paying off": {
                    "Sentimental_Value": "Positive"
                },
                ">  It can exponentially decrease errors with the addition of more qubits, addressing a quantum error correction challenge that has persisted for nearly three decades\n\nThis is huge. This could be the start of the exponential curve for quantum computing.": {
                    "Sentimental_Value": "Positive"
                },
                "imagine if sataoshi's wallet gets hacked holding 1M+ BTC. If we have advanced quantum computing, the Russians and Chinese are not far behind.": {
                    "Sentimental_Value": "Neutral"
                },
                "Elon Musk is wowed by Google’s new quantum chip, which it claims ‘cracks a key challenge’ that’s existed for almost 3 decades.\n\n* Google says its new state-of-the-art chip, called Willow, can perform computations that would take regular computers longer than the age of the universe to execute.\n\nGoogle is turning heads—including that of world’s richest man, Elon Musk—with the announcement of its new quantum chip, called Willow.\n\nHartmut Neven, founder and lead for Google Quantum AI, said the Willow chip paves the way for a full-scale quantum computer that can “benefit society by advancing scientific discovery, developing helpful applications, and tackling some of society’s greatest challenges.”\n\nAfter Alphabet CEO Sundar Pichai announced Willow on social media, X CEO Elon Musk responded with a “wow” and engaged in a back and forth with Pichai, who said “we should do a quantum cluster in space with Starship one day :).” \n\n“That will probably happen,” Musk replied.": {
                    "Sentimental_Value": "Positive"
                },
                "Pops on news from yesterday. Did y'all had to get your money cleared to buy?": {
                    "Sentimental_Value": "Neutral"
                },
                "How far out are they really from tackling modern algorithms?": {
                    "Sentimental_Value": "Negative"
                },
                "The other HUGE news today was Cruise basically shutting down their effort for a robot taxi.\n\nThey were the only real competition to Waymo.  So no Cruise any longer and that just increased Waymo's lead by a few more years.\n\nShould also be very bullish for Google.\n\nGoogle is just so well positioned right now to really fly over the next decade.": {
                    "Sentimental_Value": "Negative"
                },
                "\\> Willow completed a standard benchmark computation in less than five minutes, a task that would take one of the fastest supercomputers today more than 10 septillion years\n\n  \nWow, indeed. That's insane": {
                    "Sentimental_Value": "Positive"
                },
                "What’s hilarious is this has 0 applicability to the stock in next decade, but the whole reason it’s trading at 20 FWD PE is because of near-term concerns. \n\nSo is a semi-functioning product for 2034+ product really that meaningful to the stock? I hope so.": {
                    "Sentimental_Value": "Neutral"
                },
                "QMCO is NOT Google Quantum, before anyone starts buying that...": {
                    "Sentimental_Value": "Negative"
                },
                "What's the difference between quantum chip and AI chip?": {
                    "Sentimental_Value": "Negative"
                },
                "Why didnt the stock surge yesterday when it was announced?": {
                    "Sentimental_Value": "Negative"
                },
                "Pretty cool to see Google’s Willow chip making strides in quantum computing. Definitely something to keep an eye on, but let's see how it all pans out.": {
                    "Sentimental_Value": "Neutral"
                },
                "Sounds pretty cool. \n\nI know GCP already offers some Quantum solutions. \n\nBut I'll wait to see if this actually bears fruit. Doesn't change my thesis on Google, which I am invested in.": {
                    "Sentimental_Value": "Positive"
                },
                "Forget bitcoin! I want to see someone finally solve Chess.": {
                    "Sentimental_Value": "Negative"
                },
                "Google will dominate the future. Stocks have huge room for growth": {
                    "Sentimental_Value": "Positive"
                },
                "Nice just bought calls this morning 👌": {
                    "Sentimental_Value": "Positive"
                },
                "Held since September 2022 ![gif](emote|free_emotes_pack|give_upvote)": {
                    "Sentimental_Value": "Neutral"
                },
                "This is awesome! We will finally have vaccines ready for all the viruses that will yet to emerge. \nAnd all the other things a quantum computer can do 😄": {
                    "Sentimental_Value": "Positive"
                },
                "My two biggest positions S&P and google are in a race, google took the lead today": {
                    "Sentimental_Value": "Positive"
                }
            }
        },
        "Google's most powerful quantum computing chip, Willow, is out! Performance to beat supercomputers": {
            "Post_Info": {
                "Title": "Google's most powerful quantum computing chip, Willow, is out! Performance to beat supercomputers",
                "Score": 275,
                "Comments": 115,
                "Created": "2024-12-11 10:32:47",
                "Subreddit": "stocks",
                "Author": "longtelo",
                "URL": "https://www.reddit.com/r/stocks/comments/1hbw2yt/googles_most_powerful_quantum_computing_chip/",
                "Content": "Google has unveiled its latest quantum chip, Willow, which demonstrates revolutionary advances. With 105 quantum bits, the chip achieves sub-threshold light-travel rates for the first time, significantly improving computational stability and performance. Its run time in a random circuit sampling benchmark was less than five minutes, compared to the super conventional\n\n\n\nBy optimizing the quantum correction technology and fabrication process, Willow has taken an important step towards practicality. This technological advancement is not only a result of scientific research, but also has the potential to accelerate commercial applications, providing services in areas such as new drug discovery, AI optimization, and new energy design, as well as providing investors with the opportunity to achieve long-term returns and portfolio diversification."
            },
            "Comments": {
                "I understand some of these words": {
                    "Sentimental_Value": "Negative"
                },
                "So much good news for Google in the last 48 hours.  So not just Willow.  But the news Cruise is shutting down their robot taxi effort.\n\nCruise was a distant #2 to Waymo.   Cruise no longer just increases the Waymo lead by a few more years over everyone else.\n\nThen on top of all of that we got Gemini 2.0 flash today to boot!!": {
                    "Sentimental_Value": "Positive"
                },
                "people need to fester expectations. This first in class quantum chip is insanely impressive but its one piece in alphabets mission to developing quantum computers. They still have 3 milestones to hit in their roadmap until this becomes possible. This will serve as the brains of the operation and was probably one of the hardest feats to accomplish. The innovation coming out of google right now between their waymo, isomorphic labs and quantum division is unreal. They are setting themselves to have unmatchable compute power for decades to come. People forget how relatively young of a company alphabet is. in 20 years they have managed to develop incredible products.": {
                    "Sentimental_Value": "Positive"
                },
                "The results are pretty useless. \n\nFirst of all they solved a factorial computation, they didn't run any algorithm for real applications.\n\nTheir fidelity rate is quite low, 99.66% compared to 99.9% of the best IONQ system (Forte).\n\nAnd they have low gate speed too, and their connectivity is only between adjacent gates, which reduce the efficiency for scaling the system. \n\nIONQ with ion trap is developing all to all connectivity between gates and qubits.\n\nGoogle is developing quantum computers with superconducting, which doesn't scale.\n\nIon-trapped technology is easier to scale.": {
                    "Sentimental_Value": "Negative"
                },
                "I've been very bullish on Google this whole year, and far into the future. Loaded mostly in the low 160s. This is just the beginning": {
                    "Sentimental_Value": "Negative"
                },
                "Is it a good time to buy GOOGL?": {
                    "Sentimental_Value": "Neutral"
                },
                "Ahh, they finally solved the Quantum Subspace Coherence Stabilizer issue! That was the bottleneck preventing quantum processors from maintaining stable entanglement across distributed qubits in real-time. Now they can synchronize quantum states without decoherence, making FTL data transmission via subspace channels a reality. Looks like galactical computing clusters are officially on the horizon!": {
                    "Sentimental_Value": "Positive"
                },
                "It’s not “out.” They say it will be ready for general use in several years.": {
                    "Sentimental_Value": "Neutral"
                },
                "Is this an AI slop post??\n\nr/stocks Mods. Please clean this up. We’ve seen two separate posts on this in the past 2 days": {
                    "Sentimental_Value": "Negative"
                },
                "tldr; wake me up when they start cracking the biological code.  Produce drugs, end disease and bust bitcoin": {
                    "Sentimental_Value": "Positive"
                },
                "Any chance of a Google sprint to 220 before 2025?": {
                    "Sentimental_Value": "Positive"
                },
                "Wake me up when it can run doom": {
                    "Sentimental_Value": "Neutral"
                },
                "This tech and the advancements with Waymo have me investing quite a bit into Google": {
                    "Sentimental_Value": "Positive"
                },
                "Bought 10 shares. I’m a thrill seeker.": {
                    "Sentimental_Value": "Positive"
                },
                "![gif](emote|free_emotes_pack|money_face)": {
                    "Sentimental_Value": "Neutral"
                },
                "Google launched Willow shares on the 9th of this month up 5% in one day": {
                    "Sentimental_Value": "Positive"
                },
                "Doesn’t mean anything at this moment in time. All I cared about was that their quarterly reports were fantastic again and they were heavily undervalued recently (due to being sued by government)\n\nAlready loaded up a fair bit when it was at $169. \n\nAll I cared about is their quarterly reports continue to show they are doing well": {
                    "Sentimental_Value": "Neutral"
                },
                "No flux capacitor? Junk.": {
                    "Sentimental_Value": "Negative"
                },
                "Google is a stock you never sell. Once antitrust goes away their multiple will expand. They’re still growing and printing cash and have the greatest AI advantage and are also top 2 with Tesla for autonomous driving. Never ever ever sell Google. They’re also in the running to eventually be the largest company in the world in the next 10 years.": {
                    "Sentimental_Value": "Positive"
                },
                "Have they finally figured out how to incorporate a parametric fam without causing voltage overrides?": {
                    "Sentimental_Value": "Negative"
                }
            }
        },
        "Google, Apple, and Microsoft are facing anti trust threats ": {
            "Post_Info": {
                "Title": "Google, Apple, and Microsoft are facing anti trust threats ",
                "Score": 92,
                "Comments": 75,
                "Created": "2024-11-28 03:23:41",
                "Subreddit": "stocks",
                "Author": "stockmarkettrader",
                "URL": "https://www.reddit.com/r/stocks/comments/1h1rfit/google_apple_and_microsoft_are_facing_anti_trust/",
                "Content": "At some point do these companies momentum of growing free cash flow exponentially slow down with the looming regulatory attacks? \n\nI’m hedging with Berkshire Hathaway, but I wonder how everyone else protects their portfolios? "
            },
            "Comments": {
                "When everybody is facing antitrust threats, nobody is. Nobody has an advantage": {
                    "Sentimental_Value": "Negative"
                },
                "Yeah no surprise, no anti trust with Tesla and X. It’s all clear there LOL": {
                    "Sentimental_Value": "Positive"
                },
                "For two more months 😂": {
                    "Sentimental_Value": "Positive"
                },
                "Curious how you think Berkshire is a hedge. They hold a lot of cash right now but the stock price certainly won't act like cash in a bear market.": {
                    "Sentimental_Value": "Negative"
                },
                "Unless those regulations greatly affect their bottom line, it’s a non-issue.": {
                    "Sentimental_Value": "Neutral"
                },
                "Might as well appoint Elon Must to be the judge.": {
                    "Sentimental_Value": "Negative"
                },
                "What is Microsoft facing?": {
                    "Sentimental_Value": "Negative"
                },
                "Means it's fine to buy": {
                    "Sentimental_Value": "Positive"
                },
                "Never ever believe in the anti trust threats\n\nJust ignore them": {
                    "Sentimental_Value": "Negative"
                },
                "I'm biased but I believe this is a big nothingburg. Hoping goog will be $200+ by feb": {
                    "Sentimental_Value": "Positive"
                },
                "There is only one resolution if they really think Google has a search monopoly.   \n\nJust have a screen on every device the first time you turn on that asks your preferred search engine from a random list.\n\nThat is the obvious resolution.  Not Google giving up Chrome which is just stupid.\n\nI think they do not want to do this because it would really hurt Apple.\n\nBTW, I personally do NOT believe Google has a monopoly.  They won the space by providing a superior product.\n\nOn every single machine I use Google I could use Bing.  I just do not because Bing is pretty bad compared to Google.  Specially for anything that just recently happened.  Like your Fantasy Basketball player just got hurt.  Google will have in minutes and Bing it will take hours.": {
                    "Sentimental_Value": "Negative"
                },
                "I own all three, long on all": {
                    "Sentimental_Value": "Neutral"
                },
                "What is about Microsoft? Did i miss something about them facing anti trust recently?": {
                    "Sentimental_Value": "Negative"
                },
                "Nothing is going to happen come January.": {
                    "Sentimental_Value": "Negative"
                },
                "New administration, less regulations.  Im pretty confident all this goes away by Feb/March of next year if not the last week of Jan.": {
                    "Sentimental_Value": "Positive"
                },
                "Correction.  They were facing anti-trust threats.  With the new administration, I doubt they will going forward.": {
                    "Sentimental_Value": "Negative"
                },
                "You're not hedging anything with Berkshire. You're doubling down on Apple, and if markets correct, so will Berkshire.": {
                    "Sentimental_Value": "Negative"
                },
                "Yes, trump will stand by and watch a big tech meltdown in market value on his presidency. lol the orange man will absolutely tell the DOJ to fuck off.": {
                    "Sentimental_Value": "Neutral"
                },
                "We got at least 4 more years. Don Trumplestein wont let it happen lol. I expect even more M&A activity from all 3": {
                    "Sentimental_Value": "Positive"
                },
                "Amazon next?": {
                    "Sentimental_Value": "Negative"
                }
            }
        },
        "Reddit overtakes X in popularity of social media platforms in UK $RDDT": {
            "Post_Info": {
                "Title": "Reddit overtakes X in popularity of social media platforms in UK $RDDT",
                "Score": 1066,
                "Comments": 157,
                "Created": "2024-11-28 09:25:22",
                "Subreddit": "stocks",
                "Author": "caollero",
                "URL": "https://www.reddit.com/r/stocks/comments/1h1x2aj/reddit_overtakes_x_in_popularity_of_social_media/",
                "Content": "[https://www.theguardian.com/technology/2024/nov/28/reddit-overtakes-x-in-popularity-of-social-media-platforms-in-uk](https://www.theguardian.com/technology/2024/nov/28/reddit-overtakes-x-in-popularity-of-social-media-platforms-in-uk)\n\nReddit, the American online discussion platform, has overtaken X to become the fifth most popular social media platform in the UK, according to the communications watchdog.\n\nOfcom said Reddit, where users post on discussion threads within topic-based communities, was visited by 22.9 million UK adults in May this year, compared with 22.1 million on X.\n\nThe figures make Reddit the fastest-growing large social media platform in the UK and represent a growth of 47% on the same period in 2023. The leap took Reddit above LinkedIn and X into fifth place on the table of UK social media platforms, which is now topped by YouTube after it overtook [Facebook](https://www.theguardian.com/technology/facebook), reaching more than 44 million adults.\n\nReddit, renowned for its devoted user base who refer to one another as Redditors, appears to have been boosted by updates to Google’s search engine this year.\n\nFarhad Divecha, the managing director of the UK-based digital marketing agency AccuraCast, said: “Google’s latest algorithm update in the first half of 2024 gave Reddit a big boost in organic search traffic. I think that has probably contributed a lot.”\n\nOfcom also speculated that the change may have been caused [by alterations to how third-party apps accessed its content](https://www.theguardian.com/technology/2023/jun/14/reddit-moderators-vow-to-continue-blackout-in-api-access-fees-row), forcing users of those apps to switch to the Reddit site. The watchdog also flagged publicity around Reddit’s stock market flotation in March this year.\n\nThe popularity of X also fell over the same period, according to Ofcom, with its reach falling by 8% since May last year. X has been criticised over content moderation standards since its [takeover by Elon Musk in 2022](https://www.theguardian.com/technology/2022/oct/28/elon-musk-twitter-hate-speech-concerns-stock-exchange-deal) but it has also faced competition since July 2023 from Threads, a rival to X [launched by Mark Zuckerberg’s Meta](https://www.theguardian.com/technology/2023/jul/06/meta-launches-twitter-rival-threads-in-100-countries).\n\nThe Ofcom figures featured in the watchdog’s annual report into the nation’s digital habits, which revealed that four out of 10 UK adults say they have encountered misinformation or deepfakes, with the majority of those cases occurring online.\n\nThe misinformation survey, based on a poll of more than 4,000 UK adults, also found that three in 10 adults believe there is a single group of people who control the world together, with the same number believing there is “significant evidence” of electoral fraud in the UK.\n\nThe regulator also found that one-third of UK adults are not confident in judging whether an image or a piece of audio or video has been created by artificial intelligence."
            },
            "Comments": {
                "Enjoying Reddit less the more popular it gets": {
                    "Sentimental_Value": "Negative"
                },
                "I'm curious how they define popularity of any of these sites, especially when it comes to determining whether to include bots.": {
                    "Sentimental_Value": "Negative"
                },
                "26b for the 6th most visited website seems low": {
                    "Sentimental_Value": "Negative"
                },
                "What does the election fraud stuff at the end have to do with X's stock? Hello bot?": {
                    "Sentimental_Value": "Negative"
                },
                "Twitter fucking blows": {
                    "Sentimental_Value": "Negative"
                },
                "The election is over. The paid bots are gone. I'm not buying this. They may have one more good earnings, but it's going downhill after the election season. \n\nUK has it's own issues, which makes Reddit relevant for them, but overall, Reddit, I don't expect Reddit to do well. This is reflected in a lot of media outlets that rely on a left leaning base and ratings massively dropped.": {
                    "Sentimental_Value": "Negative"
                },
                "I like Reddit": {
                    "Sentimental_Value": "Positive"
                },
                "I’m sure that Reddit is taking over a fair share of Social Media in the future… as specific forums/boards are kind of dead, Reddit is the place to go at this point of time (FB groups aren’t a competition imo)\nI’ll put some play money on it… let’s see what happens!": {
                    "Sentimental_Value": "Positive"
                },
                "X is shit and gone worse under Elon Musk. \nReddit ⬆️ X ⬇️": {
                    "Sentimental_Value": "Neutral"
                },
                "Yeahhh I don't buy that for a second. Reddit used to be great but now it's just a wasteland and an echo chamber by comparison.": {
                    "Sentimental_Value": "Negative"
                },
                "The funniest thing about reddit is that people love to spend their time complaining on reddit about how reddit sucks. They are kind of like star wars fans. They hate everything that got released since the original trilogy but they nonetheless consume everything star wars related voraciously.  \n\nThe protest thing over the API was so funny to me. Just stop going to reddit, stop giving them engagement, that's how you can hurt reddit the most. Not posting memes about fuck spez or whatever. People just love this site, they can't get off of it. \n\nThat's one of the reason I'm long this stock.": {
                    "Sentimental_Value": "Negative"
                },
                "I don't even know how X is measured. They're such an overwhelming number of marketing accounts and bots. With Reddit those accounts are actively driven off": {
                    "Sentimental_Value": "Neutral"
                },
                "The question is when do we start seeing marketing shops offerring Reddit ads as services. It's still quite niche. Look up any local ad shop near you and see if they mention they offer Reddit ads as a service. My guess is you won't find any..they focus on Google  / Meta etc.": {
                    "Sentimental_Value": "Negative"
                },
                "OP: Reddit overtakes X in popularity\n\nMe: Oh damn thats huge\n\nOP: In the UK\n\nMe: Oh never mind": {
                    "Sentimental_Value": "Neutral"
                },
                "..people love an echo chamber.": {
                    "Sentimental_Value": "Positive"
                },
                "I don't buy this article at all.   This is institutions whobown Redit wanting retail to jump in.  \n\nRrdit is nothing more than Facebook 2.0.....": {
                    "Sentimental_Value": "Negative"
                },
                "X is worthless so what does this mean": {
                    "Sentimental_Value": "Negative"
                },
                "Anyone can get to #1 with enough bots making trash ai posts all the time.": {
                    "Sentimental_Value": "Negative"
                },
                "X is more like small texting vs RDDT email chains\n\nMore content without so much personal weight\n\nYou know like less influencer type content": {
                    "Sentimental_Value": "Neutral"
                },
                "X got soft locked, less then rumble but close...": {
                    "Sentimental_Value": "Neutral"
                }
            }
        }
    },
    "Amazon": {
        "Amazon sued by DC attorney general for allegedly excluding neighborhoods from Prime delivery": {
            "Post_Info": {
                "Title": "Amazon sued by DC attorney general for allegedly excluding neighborhoods from Prime delivery",
                "Score": 4003,
                "Comments": 355,
                "Created": "2024-12-04 08:52:03",
                "Subreddit": "technology",
                "Author": "Puginator",
                "URL": "https://www.cnbc.com/2024/12/04/amazon-sued-by-dc-ag-over-excluding-areas-from-prime-delivery.html",
                "Content": ""
            },
            "Comments": {
                "This will probably be like Domino's and there will be some sheepish announcement in three years where they talk about corrective actions but Amazon still won't deliver there due to crime.": {
                    "Sentimental_Value": "Negative"
                },
                "\"The lawsuit from AG Brian Schwalb alleges that, since 2022, Amazon has “secretly excluded” two “historically underserved” D.C. ZIP codes from its expedited delivery service while charging Prime members living there the full subscription price.\" ...\n\n\" “While Amazon has every right to make operational changes, it cannot covertly decide that a dollar in one zip code is worth less than a dollar in another.”\" ...\n\n\"In June 2022, Amazon allegedly stopped using its own delivery trucks to shuttle packages in the ZIP codes 20019 and 20020 based on concerns over driver safety, the suit states. In place of its in-house delivery network, the company relied on outside carriers like UPS and the U.S. Postal Service to make deliveries...\"\n\n\"Data from the AG shows that before Amazon instituted the change, more than 72% of Prime packages in the two ZIP codes were delivered within two days of checkout. That number dropped to as low as 24% following the move, while two-day delivery rates across the district increased to 74%.\" ...\n\n\"The ZIP codes in Schwalb’s complaint are in areas with large Black populations...\"": {
                    "Sentimental_Value": "Negative"
                },
                "Or here’s an idea… maybe sue people to stop stealing all the stuff and attacking delivery drivers?\n\nOr maybe the AG should try delivering packages there if he’s so concerned about it.": {
                    "Sentimental_Value": "Negative"
                },
                "Would be curious to know if this is the case in other cities cause I could easily see Prime being excluded from places like the Kensington neighborhood in Philly": {
                    "Sentimental_Value": "Negative"
                },
                "You know, I’m suspect af of big business, but if package thefts are too high or drivers get assaulted/robbed, then they ought to be able to make that decision. Assuming that’s the case of course, as claimed.\n\nNow that being said, if you’re in that zip, and have Prime, and paid the full price, you ought to get a discount.": {
                    "Sentimental_Value": "Neutral"
                },
                "Much of rural America is also only served by UPS and USPS delivery for Amazon packages--for example in the small town where I live. It's simply an economic decision and has nothing to do with racism. And again people there pay exactly the same Prime subscription fees and may get slower delivery.": {
                    "Sentimental_Value": "Negative"
                },
                "Community full of crime. Drivers being followed so people can steal packages. \n\n\nYeah. Blame the companies that don't want to deliver to these \"certain\" neighborhoods. ": {
                    "Sentimental_Value": "Negative"
                },
                "Prosecute Amazon and not criminals, got it.": {
                    "Sentimental_Value": "Positive"
                },
                "Some neighborhoods ARE too dangerous to deliver to. If packages are continuously stolen, it doesn’t make sense to operate there. \n\nAmazon delivers to the middle of no where, it’s not a logistical issue. Fix your crime problem DC and you’ll get your delivery.": {
                    "Sentimental_Value": "Negative"
                },
                "Let’s blame the company who wont deliver to the crime ridden neighborhoods instead of doing something about the crime..\n\nAmazon is nobody’s friend but what a waste of taxpayer resources with this lawsuit. \n\nWhen I worked at Pizza Hut in high school, we had entire blocks crossed off the map because it was too dangerous. If a driver got robbed, that street was forever banned for delivery, which seems perfectly reasonable to me.": {
                    "Sentimental_Value": "Negative"
                },
                "Anyone that's upset feel free to sign up for Amazon Flex and deliver in those neighborhoods.\n\n\nYou're a hypocrite if you don't.": {
                    "Sentimental_Value": "Positive"
                },
                "This is just smart business. Sounds like they were charging though…but if you’re in the business of dropping valuables off on people’s porches, then it’s bad for business to be doing so in high crime areas.": {
                    "Sentimental_Value": "Negative"
                },
                "Absolutely they can. Tomorrow they’ll be sued because they didn’t protect their drivers knowing they are sending them into war zones.\n\nI can be left on some damn things but this ain’t one of them. Neighborhoods don’t have rights. Yeah it sucks for the people that live there but someone shouldn’t have to put their life in danger to deliver a package.": {
                    "Sentimental_Value": "Neutral"
                },
                "From the Article\n\n“In the zip codes in question, there have been specific and targeted acts against drivers delivering Amazon packages. We made the deliberate choice to adjust our operations, including delivery routes and times, for the sole reason of protecting the safety of drivers.”\n\nIf drivers are getting robbed, why should Amazon put their employees at risk of physical violence?": {
                    "Sentimental_Value": "Negative"
                },
                "Shit holes are gonna b shitholes. Have it delivered to an Amazon drop box.": {
                    "Sentimental_Value": "Negative"
                },
                "Yeah you have to be forced to deliver everywhere. You're infringing on those gangmembers' right to assault and rob you": {
                    "Sentimental_Value": "Neutral"
                },
                "This is interesting. Since they’re not brick-and-mortar, they can’t just lock everything behind plexiglass like CVS and Wal-Mart. \n\nFeels like Amazon should just not allow prime subscriptions to addresses in certain areas since they have a right as a private business to refuse service, and they aren’t delivering within the two-day window like the subscription with prime is meant to do. \n\nAmazons spokesperson:\n\n“We want to be able to deliver as fast as we possibly can to every zip code across the country, however, at the same time we must put the safety of delivery drivers first,” Kelly said in a statement. “In the zip codes in question, there have been specific and targeted acts against drivers delivering Amazon packages. We made the deliberate choice to adjust our operations, including delivery routes and times, for the sole reason of protecting the safety of drivers.”\n\nKelly said Amazon has offered to work with the AG’s office on efforts “to reduce crime and improve safety in these areas.”\n\nIn June 2022, Amazon allegedly stopped using its own delivery trucks to shuttle packages in the ZIP codes 20019 and 20020 based on concerns over driver safety, the suit states. In place of its in-house delivery network, the company relied on outside carriers like UPS and the U.S. Postal Service to make deliveries, according to the complaint, which was filed in D.C. Superior Court.": {
                    "Sentimental_Value": "Negative"
                },
                "There are areas cops won't even go into.": {
                    "Sentimental_Value": "Neutral"
                },
                "It sucks for the ones affected but this is lifted straight from the Prime benefits description:\n\n\"Delivery benefits and speeds vary from item to item, and not all benefits and speeds are available in all areas.\"\n\nI don't think the AG has a leg to stand on. While it would be nice if Amazon offered a lower-price membership when some things are unavailable, you can't force companies to offer discounts.": {
                    "Sentimental_Value": "Neutral"
                },
                "Instead of suing a company that doesn’t want to deliver to a crime ridden neighborhood, how about the government stop the crime in that neighborhood": {
                    "Sentimental_Value": "Negative"
                },
                "Who’s the bigger dirt bag here? Amazon for taking the money. Or the lawyer suing because Amazon won’t send its underpaid workers into harms way to deliver someone’s socks fast enough. Jesus wept.": {
                    "Sentimental_Value": "Negative"
                },
                "Imagine actually policing these areas instead of suing Amazon for not being willing to get robbed.": {
                    "Sentimental_Value": "Neutral"
                },
                "Next up : Chinese and pizza restaurants sued for not delivering to the people who keep robbing them": {
                    "Sentimental_Value": "Negative"
                },
                "Charging for a service they're not providing is wrong.  But not wanting to deliver packages in SE DC, totally understandable.  \n\nSource:  I grew up in this area": {
                    "Sentimental_Value": "Negative"
                },
                "They really are trying to sue mag 7 for literally anything": {
                    "Sentimental_Value": "Negative"
                },
                "I wonder why the DA isn’t trying to solve the root cause of this issue (crime) rather than the symptom (companies trying to avoid crime). \n\nIf crime in those zip codes got on par with others it seems like that would be a resolve all of the issues and many more.": {
                    "Sentimental_Value": "Negative"
                },
                "I lived in DC in a \"nice\" neighborhood that is much safer than these. Carjacking is extremely common. Package theft is extremely common.   \n\nI personally witnessed 4 carjackings on 3 years. If you're an Amazon driver there it's HIGHLY likely you'd get held up at gunpoint. Not that DC government cares. They just let a guy go without bail who was on camera spraying AK47 fire in a neighborhood at people. Yep. That happened. Recently.": {
                    "Sentimental_Value": "Neutral"
                },
                "Amazon should just tell the people 2 day shipping is often not available in those zip codes. Just a warning that comes across when they subscribe. Easy fix.": {
                    "Sentimental_Value": "Negative"
                },
                "Amazon should counter sue stating that DC has failed Ward 7 and 8 residents by not providing basic safety policing to ensure companies like Amazon and their workers feel safe to deliver packages.": {
                    "Sentimental_Value": "Negative"
                },
                "Sounds like those areas aren't safe.  Work on that, DC.": {
                    "Sentimental_Value": "Negative"
                },
                "Bullish": {
                    "Sentimental_Value": "Negative"
                },
                "I expect this to open up to a class action at some point. Amazon does this all over the country, and not just in high crime areas. I'm in a gated community and for the last 2 years, I haven't received a single package in less than 4 days. I actually stopped ordering from Amazon because ordering direct from the actual company almost always ships faster": {
                    "Sentimental_Value": "Negative"
                },
                "Are they preventing the customers from cancelling if they don't like the service? It's a subscription...if the service sucks, the customer can just cancel.": {
                    "Sentimental_Value": "Negative"
                },
                "Interesting - I used to live in 20019 - its a 'pre-gentrified' neighborhood/ward but very diverse - Some of it is very 'suburban', wider streets, craftsman style houses. There is a concentrated area downtown which has a number of apartment high rises and some shops. And there are some larger projects (notably Kenilworth in 20019 and Barry Frams in 20020), which although I ventured into a number of times, are....rough.\n\nIts a really complex problem. Its in part of DC called 'East of the (Anacostia) River' or EOTR. And has historically been an impoverished black part of the city. Even in the 90s when all of DC was rough, this area was the worst of the worst. And because of the river its remained sectioned off, and even despite investments from DC, has been the slowest to proper in the thriving DC. The same reason that Amazon doesnt want to deliver there is the same reason its a food desert - crime. The most egregious corporate offender though was Walmart who agreed to put 2? stores in 20019 and 20020 back in \\~2017 if memory serves in exchange for puting stores in more affluent parts of DC. They built the stores they wanted and then reneged on the 2 others, and saw no consequences.\n\nI understand why Amazon doesn't feel like its safe to deliver there, but I had prime when I lived there, and it helped tremendously to offset the food/shopping desert. There needs to be stronger representation (Trayon White down in 20020 for example is a criminal who keeps getting relected), and more advocacy groups need to be vocal about the issues in this part of DC.\n\nI know this is a stock sub - this will be an immaterial lawsuite for amazon - but its a major social and political issue that many urban areas across the country face. These large companies need to be held at least somewhat accountable to provide equal services, they certainly get preferential treatment in our society, they should be helping to solve these issues not contributing to them, they certainly have the capital to do so.\n\nQuick note: I loved living in 20019 - understanding that I have a different perspective I am privileged (good income, white male) - the neighborhood was warm and welcoming, we would help each other out, and there were many genuinely kind people. I would not hesitate to return at a different stage in life.": {
                    "Sentimental_Value": "Positive"
                },
                "If I paid for a service and didn't receive the service, I would probably just stop paying for it and ask for a refund.": {
                    "Sentimental_Value": "Negative"
                },
                "Put the commanders new stadium there, throw is a bunch of shops, keep pushing residents out into PG county": {
                    "Sentimental_Value": "Positive"
                },
                "I mean... Amazon is one of the easiest return retailers I have ever used. I dont even have to leave home to get a refund. You are telling me that all these homes not getting service couldnt get a refund on their membership? You are telling me Amazon gave them a hard time about it? Give me a break...\n\nNow all that said, Prime isnt just delivery. Prime includes pricing discounts on products, which I use all the time. It is rather significant actually. I also get like 2-5 free video games, good ones mind you, every month as part of prime gaming. I recently picked up Bioshock Remastered, Call of Juarez, Dredge, and Tales from Borderlands series for free... They do this every month. Prime also gets you their video and music streaming. This includes stuff like the Lord of the Rings, Fallout and Bosch. The Boys is on there too if youre into that.\n\nSo what exactly is the AG going to get out of this? If Amazon cancels Prime to those locations, the customers would lose the stuff I listed above. Isnt it better to give customers a choice rather than force a company to not provide a service to them due to litigation?": {
                    "Sentimental_Value": "Negative"
                },
                "I live in a fancy DC neighborhood and it takes a week to get most stuff now. Why do I even pay for Prime??": {
                    "Sentimental_Value": "Negative"
                },
                "The mf that should be suing the government for having neighborhoods that are unsafe to live (and to deliver goods to them) is suing a company that is \"protecting\" the drivers from being attacked or from having their property stolen. It is not that amazon deserves any praise and in particular I don't like it, but this is how broken things are right now.": {
                    "Sentimental_Value": "Negative"
                },
                "So Amazon wants to keep it's employees and products safe and gets sued by the government who's supposed to keep the area safe?\n\nSounds legit.": {
                    "Sentimental_Value": "Negative"
                }
            }
        },
        "‘My heart is in Amazon’: Jeff Bezos returns to Amazon’s frontlines with a focus on AI": {
            "Post_Info": {
                "Title": "‘My heart is in Amazon’: Jeff Bezos returns to Amazon’s frontlines with a focus on AI",
                "Score": 739,
                "Comments": 109,
                "Created": "2024-12-08 16:35:35",
                "Subreddit": "stocks",
                "Author": "Lunaerus",
                "URL": "https://www.reddit.com/r/stocks/comments/1h9thrg/my_heart_is_in_amazon_jeff_bezos_returns_to/",
                "Content": "“Jeff Bezos, Amazon’s founder and former CEO, has re-emerged as a driving force at the tech giant, dedicating 95% of his time to advancing artificial intelligence initiatives. Speaking at the DealBook Summit on Wednesday, Bezos expressed his enduring connection to the company he founded 30 years ago, even after stepping down as CEO in 2021.\n\n“My heart is in Amazon, my curiosity is in Amazon, and my fears are there, and my love is there,” Bezos said, reinforcing his deep ties to the company and its mission.\n\nBezos’s renewed focus on AI comes as Amazon seeks to assert itself in the rapidly evolving technology landscape. The company is currently developing over 1,000 internal AI applications and aims to leverage this momentum to remain competitive with industry giants like Google, Microsoft, and OpenAI.\n\nOne of the cornerstone projects under Bezos’s watch involves building a cutting-edge supercomputer in partnership with Anthropic, the AI startup in which Amazon recently invested $8 billion. This supercomputer is expected to power a multimodal AI model capable of analysing images, video, and text, further enhancing Amazon’s AI capabilities.\n\nAlthough Bezos stepped down as CEO to focus on his space venture, Blue Origin, he continues to serve as Amazon’s executive chairman, actively supporting CEO Andy Jassy and the leadership team. His involvement mirrors a broader trend of tech founders, such as Google’s Larry Page and Sergey Brin, returning to their companies to steer AI-focused strategies.\n\n“I’ll always be there to help, and right now, I’m putting a lot of time into it,” Bezos said. “It’s super interesting, so why not?”\n\nAmazon’s AI ambitions are supported by significant investments in infrastructure and talent. The company is betting big on the transformative potential of artificial intelligence to enhance its services and operations, positioning itself as a serious contender in the ongoing AI race.\n\nBezos’s hands-on approach signals his commitment to Amazon’s future during this pivotal time in technological innovation. His involvement aligns with the company’s broader goals of integrating AI into various aspects of its operations, from customer service to cloud computing.\n\nBezos’s renewed focus on Amazon coincides with a surge in his net worth, which reached $228 billion last month, according to the Bloomberg Billionaires Index. The increase was driven by Amazon’s stock hitting a record $207.09 per share, boosting Bezos’s wealth by $7 billion as he continues to hold nearly 9% of the company.”\n\nSource: https://www.businesstoday.in/amp/technology/news/story/my-heart-is-in-amazon-jeff-bezos-returns-to-amazons-frontlines-with-a-focus-on-ai-456555-2024-12-07"
            },
            "Comments": {
                "He gotta fight to get richer than elon once more": {
                    "Sentimental_Value": "Positive"
                },
                "Oh, so that's why Bezos is suddenly optimistic about Trump.": {
                    "Sentimental_Value": "Neutral"
                },
                "Amazon’s FCF is absolutely insane. Jassy is gonna Tim Cook this company towards over a decade of 20%+ CAGR. I would not be surprised if they end up #1 in market cap. Also Trump said today he’s agreed to meet Bezos for dinner. Bezos will suck up to get on Trump’s good side which is good for the stock.\n\nBiggest risks are tariffs hurting e-commerce and antitrust but Amazon is diversified and printing enough cash to weather most storms. I think the worst is behind Amazon after they overspent in 2020-21 and got hammered by inflation in 2022. \n\nAI will also help them in so many ways. Fatter margins due to lower headcount, AWS, ad business, etc etc.": {
                    "Sentimental_Value": "Negative"
                },
                "My theory is they will eventually upload Alexa into Optimus and you'll be able to buy a 300-pound paperweight that can tell you the time, weather and jokes.": {
                    "Sentimental_Value": "Positive"
                },
                "Time to re-buy . But lets wait the dip between now and march": {
                    "Sentimental_Value": "Positive"
                },
                "He is bored.": {
                    "Sentimental_Value": "Negative"
                },
                "That DealBook interview was very good. Bezos went into a lot of topics, including how he thinks Blue Origin may end up being a bigger business than Amazon. Andrew Ross Sorkin got him comfortable, which allowed Bezos to delve into his thought process and philosophies - well worth listening to.": {
                    "Sentimental_Value": "Positive"
                },
                "$AMZN will double in 4 yeara": {
                    "Sentimental_Value": "Positive"
                },
                "These corporations are going to be the end of humanity": {
                    "Sentimental_Value": "Negative"
                },
                "Maybe get rid of all the fake reviews first jeff.": {
                    "Sentimental_Value": "Negative"
                },
                "I keep seeing that Amazon is \"trying to catch up\". \n\nWhether true or not, Amazon really has all the tools and management needed to be very successful in AI. They can incorporate it in must about all parts of their business. Whether in their warehouses for efficiencies (which they are already doing and accelerating) or in Advertising, or in 3rd party services, or in Prime Video (for ads I think), or in Cloud or in new things they are playing the long game in, like Project Kuiper. \n\nAlso, even though Bezos is not letting go of Amazon completely, I'm glad there are no stories of issues between Jassy and Bezos. \n\nThink I'll buy more AMZN soon 😅": {
                    "Sentimental_Value": "Positive"
                },
                "\"frontlines\" oh word so is he busting his ass on the warehouse floor without piss breaks?": {
                    "Sentimental_Value": "Neutral"
                },
                "I forget where i heard it but someone said something that made amazon click for me:   \nGoogle is such a good business that everything else looks aweful in comparison which is why they fail to diversify. Amazon's core business on the other hand is so bad, everything else looks like a great idea so they succeed in their other revenue streams.\n\nOf all the big tech companies only 2 really have done a great job diversifying, amazon and microsoft, and of the two amazon's the only one that did it organically.": {
                    "Sentimental_Value": "Negative"
                },
                "is he also RTOing?": {
                    "Sentimental_Value": "Negative"
                },
                "My stock will go up": {
                    "Sentimental_Value": "Negative"
                },
                "Looks like knows blue origin has no future with Elon determining federal space expenditures. Kind of a shame he seemed really passionate about it on Lex Freidman.": {
                    "Sentimental_Value": "Negative"
                },
                "It looks like OP posted an AMP link. These should load faster, but AMP is controversial because of [concerns over privacy and the Open Web](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot).\n\nMaybe check out **the canonical page** instead: **[https://www.businesstoday.in/technology/news/story/my-heart-is-in-amazon-jeff-bezos-returns-to-amazons-frontlines-with-a-focus-on-ai-456555-2024-12-07](https://www.businesstoday.in/technology/news/story/my-heart-is-in-amazon-jeff-bezos-returns-to-amazons-frontlines-with-a-focus-on-ai-456555-2024-12-07)**\n\n*****\n\n ^(I'm a bot | )[^(Why & About)](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot)^( | )[^(Summon: u/AmputatorBot)](https://www.reddit.com/r/AmputatorBot/comments/cchly3/you_can_now_summon_amputatorbot/)": {
                    "Sentimental_Value": "Neutral"
                },
                "He has a heart? I’m shocked…": {
                    "Sentimental_Value": "Neutral"
                },
                "\"My net worth is in Amazon.\"": {
                    "Sentimental_Value": "Negative"
                },
                "Ai is the cool buzzword right now": {
                    "Sentimental_Value": "Positive"
                }
            }
        },
        "Elon Musk becomes the first person to reach a net worth of $400 billion": {
            "Post_Info": {
                "Title": "Elon Musk becomes the first person to reach a net worth of $400 billion",
                "Score": 1613,
                "Comments": 284,
                "Created": "2024-12-11 20:51:20",
                "Subreddit": "stocks",
                "Author": "WickedSensitiveCrew",
                "URL": "https://www.reddit.com/r/stocks/comments/1hca86o/elon_musk_becomes_the_first_person_to_reach_a_net/",
                "Content": "https://www.cnn.com/2024/12/11/business/elon-musk-400-billion-net-worth/index.html\n\n> Elon Musk’s net worth has reached $400 billion, according to Bloomberg, making him the first person ever to cross that mark. Behind his nearly $20 billion jump in wealth was a deal that shot up Musk’s rocket company SpaceX’s valuation to roughly $350 billion, Bloomberg reported Tuesday. SpaceX and its investors agreed to purchase as much as $1.25 billion of insider shares. Tesla shares closed at a record high on Wednesday, hitting $424.77 at market close. Musk, who is Tesla’s largest individual shareholder, has also enjoyed the stock propelling higher in part due to the broader market — NASDAQ topped 20,000 for the first time ever Wednesday. Since Election Day, the EV maker’s stock has rallied roughly 65% on investors’ belief that Musk’s influence in the Trump administration will usher in an era of deregulation that will benefit the company.\n\n> His artificial intelligence startup, xAI, also more than doubled in value in November amid a new funding round, surging to $50 billion from a few months ago, according to the Wall Street Journal. The world’s wealthiest man is now roughly $136 billion richer since November 5, according to the Bloomberg Billionaires Index. While the top spots on the billionaires index typically switch around, Musk is racing past his wealthy peers. As of December 10, before his wealth skyrocketed to $400 billion, he was already $140 billion richer than the second-richest man on Earth, Amazon founder Jeff Bezos.\n\n> Musk’s record-breaking Tesla-shareholder-approved pay package, which was worth $101 billion, was rejected by a Delaware court last week. Bloomberg’s calculation still seems to include the pay package, which is now worth as much as $120 billion based on the current value of Tesla shares."
            },
            "Comments": {
                "Ironic how valuable that Twitter buy ended up being. Easily recouped his investment": {
                    "Sentimental_Value": "Positive"
                },
                "Whew, I was a bit worried he was having trouble putting food on the table": {
                    "Sentimental_Value": "Neutral"
                },
                "I wonder how long his friendship with Trump will last.": {
                    "Sentimental_Value": "Negative"
                },
                "SpaceX will keep him on top of the list even if Tesla returns back to reality one day.": {
                    "Sentimental_Value": "Positive"
                },
                "He owns 50% of starlink.  Starlink privately is 350 billion.  Once starlink ipos it will easily double.": {
                    "Sentimental_Value": "Negative"
                },
                "That’s obscene.": {
                    "Sentimental_Value": "Negative"
                },
                "Yay we’re going to have trillionaires soon..said no one ever": {
                    "Sentimental_Value": "Positive"
                },
                "Why is the US suddenly so cool with cronyism?": {
                    "Sentimental_Value": "Neutral"
                },
                "He’s increased his net worth since the election more than the annual GDP of most countries.": {
                    "Sentimental_Value": "Positive"
                },
                "Interesting how all the most wealthy people didnt get their wealth through index funds.": {
                    "Sentimental_Value": "Negative"
                },
                "Gross": {
                    "Sentimental_Value": "Negative"
                },
                "this is a sustainable system we got going on that's totally not made up": {
                    "Sentimental_Value": "Negative"
                },
                "Where are those Tesla shorts at?": {
                    "Sentimental_Value": "Neutral"
                },
                "The most amazing thing is that some Americans are so biased and hateful they actually think he is a moron and not smart . Running a mom and pop store has a 99% failure rate with the average American . Running any business that huge is absurd": {
                    "Sentimental_Value": "Negative"
                },
                "Guillotine": {
                    "Sentimental_Value": "Neutral"
                },
                "Yet he tells me America sucks and needs an overhaul": {
                    "Sentimental_Value": "Negative"
                },
                "[removed]": {
                    "Sentimental_Value": "Negative"
                },
                "He is such an insufferable tool": {
                    "Sentimental_Value": "Neutral"
                },
                "Fake news. Look at the saudis": {
                    "Sentimental_Value": "Negative"
                },
                "Looks tasty": {
                    "Sentimental_Value": "Positive"
                }
            }
        },
        "If you had to start again today and could only choose five stocks to set you up for the rest of your life, what would they be?": {
            "Post_Info": {
                "Title": "If you had to start again today and could only choose five stocks to set you up for the rest of your life, what would they be?",
                "Score": 262,
                "Comments": 435,
                "Created": "2024-12-08 13:17:36",
                "Subreddit": "stocks",
                "Author": "BlackChef6969",
                "URL": "https://www.reddit.com/r/stocks/comments/1h9oztr/if_you_had_to_start_again_today_and_could_only/",
                "Content": "If you had to start again today and could only choose five stocks to set you up for the rest of your life, what would they be?\n\nImagine you can't do any day trading or chopping and changing. Just five stocks to set you up for the long term.\n\nThe tech and AI ones are obvious, particularly stuff like Amazon, NVIDIA, Microsoft etc. I struggle to think of what would be in my guaranteed top five though."
            },
            "Comments": {
                "If we are actually talking about the rest of my life then I would probably choose something like Coca Cola, McDonalds, Berkshire, Amazon and Google.": {
                    "Sentimental_Value": "Positive"
                },
                "“The tech and AI ones are obvious..”\n\nThis is such a dangerous statement. There is no such thing as a forever investment.": {
                    "Sentimental_Value": "Negative"
                },
                "COST\n\nWSM\n\nMSFT\n\nNVDA\n\nGOOG": {
                    "Sentimental_Value": "Negative"
                },
                "I'm going CP, SPGI, ASML, V, BRK.": {
                    "Sentimental_Value": "Positive"
                },
                "BRK.a (4 of those and your good lol)\n\nMSFT\n\nWM\n\nTSMC\n\nAMZN": {
                    "Sentimental_Value": "Neutral"
                },
                "S&P Global Inc\n\nFair Isaac Corporation\n\nVisa\n\nWalmart\n\nAmazon": {
                    "Sentimental_Value": "Neutral"
                },
                "Brkb amzn, msft": {
                    "Sentimental_Value": "Negative"
                },
                "The flaw in picking stocks for the rest of our lifetimes is we simply can’t see far enough ahead to know what the next generation of disruptors will look like. For that reason, I’d choose a basket of index funds. The funds will change with the times.": {
                    "Sentimental_Value": "Negative"
                },
                "Surprised by the lack of aapl on most lists.": {
                    "Sentimental_Value": "Negative"
                },
                "I wouldn't. I would do the s&p 500.": {
                    "Sentimental_Value": "Neutral"
                },
                "ASTS, IONQ, RKLB, SMR, OKLO": {
                    "Sentimental_Value": "Negative"
                },
                "- XOM: we will always need energy\n- WM: we will always create waste\n- V: we will always transact\n- AMGN: we will always improve our bodies \n- GOOGL: we will always seek information \n\nThese particular companies have also shown they can innovate, change, and adjust to the current landscape. To wit, and not a complete list:\n\n- XOM: has added new energy to the portfolio \n- WM: has expanded into medical waste \n- V: has invested in blockchain\n- AMGN: active acquirer \n- GOOGL: constantly growing as a conglomerate (Search, YouTube, Ads, Productivity, Android, Waymo, capital/venture, etc.)": {
                    "Sentimental_Value": "Neutral"
                },
                "AAPL, Amazon, Microsoft, Berkshire, Costco, TSMC": {
                    "Sentimental_Value": "Positive"
                },
                "I'm going with GOOGL, TSLA, IBKR, APO, and WISE.  \nStrong management is very important for a company's long-term health.": {
                    "Sentimental_Value": "Neutral"
                },
                "Technology and the way we live and work is changing at an ever-fast pace. No companies survive forever - and assuming you can pick any stocks 'for life' is silly. If that is how you think about investing, buy VOO because it's how you invest in etfs. Not single stocks.": {
                    "Sentimental_Value": "Positive"
                },
                "Amzn, meta, google, nvda, msft. Replace apple With any of those. I own all 6 and thay make up the bulk of my stock portfolio,": {
                    "Sentimental_Value": "Negative"
                },
                "GOOG\nMETA\nAMD\nNVIDIA\nTSMC\n\nif I had a pick another it should be\nIONQ(I believe that they could get their chunk in QC)": {
                    "Sentimental_Value": "Negative"
                },
                "Crwd amzn V sofi and Msft": {
                    "Sentimental_Value": "Negative"
                },
                "British American tobacco, Mcdonald, Coca Cola, Walmart, Lockheed Martin. (Yes I'm going to hell but I like profit and stability).": {
                    "Sentimental_Value": "Neutral"
                },
                "COST, AMZN, GOOGL, MSFT, NFLX": {
                    "Sentimental_Value": "Negative"
                }
            }
        }
    },
    "Tesla": {
        "Tesla Cybertuck Line Workers Told To Stay Home: ‘No Need To Report To Work’ | It looks like there’s a demand problem for the electric pickup that allegedly had millions of reservations before going on sale.": {
            "Post_Info": {
                "Title": "Tesla Cybertuck Line Workers Told To Stay Home: ‘No Need To Report To Work’ | It looks like there’s a demand problem for the electric pickup that allegedly had millions of reservations before going on sale.",
                "Score": 19483,
                "Comments": 2302,
                "Created": "2024-12-03 07:54:16",
                "Subreddit": "technology",
                "Author": "chrisdh79",
                "URL": "https://insideevs.com/news/743007/tesla-cybertruck-assembly/",
                "Content": ""
            },
            "Comments": {
                "It's an overpriced piece of shit": {
                    "Sentimental_Value": "Negative"
                },
                "I remember when it was announced, the base model was going to be $39,950. $59.950 for the mid tier and $79.950 for the top dog.": {
                    "Sentimental_Value": "Neutral"
                },
                "Nobody wants a Deplorean.": {
                    "Sentimental_Value": "Negative"
                },
                "A truck that can’t truck for twice the price of a fully capable truck.  Sounds about right.": {
                    "Sentimental_Value": "Neutral"
                },
                "Completely underwhelming vehicle with significant reliability issues. Go figure. ": {
                    "Sentimental_Value": "Negative"
                },
                "I saw a cyber truck for the first time with my own eyeballs yesterday. I felt embarrassed for the driver.": {
                    "Sentimental_Value": "Neutral"
                },
                "From the article: It’s an attention-grabbing machine, and its sales success has so far been undeniable. It managed to climb to the top of the best-selling electric pickups chart in the second quarter in the United States, surpassing the Rivian R1T and Ford F-150 Lightning, both of which have been on sale for longer.\n\nBut the initial boost seems to be drying out. Yesterday, workers at Tesla’s Austin factory, which assembles the Cybertruck, were told to stay home for the next three days, according to a memo seen by Business Insider. \"On Tuesday, Wednesday, and Thursday this week (Dec. 3-5), you do not need to report to work,\" the memo said.\n\nWorkers were told to report back to work on Friday and that they would still be paid for the three days that they were supposed to work. Tesla doesn’t reply to questions from the media, so there’s no way of confirming if this is related to a demand problem or something else. Some workers would not follow the adjusted schedule and would be notified separately, the memo said.\n\nHowever, factory workers on the Cybertruck line have occasionally been given other duties instead of building trucks since late October, according to Business Insider. Four workers said they had inconsistent schedules in the past month, either because they were sent home or given additional training exercises or cleaning duties instead of regular duties.\n\n\"When I started at Tesla you could expect to get overtime pay, now I feel lucky to get 40 hours,\" one worker on the Cybertruck line said.": {
                    "Sentimental_Value": "Neutral"
                },
                "Was dead set on buying a Tesla for 6+ years - Maga Elon completely soured the brand for me. \n\n\nHyundai Ioniq or VW ID for me now.": {
                    "Sentimental_Value": "Negative"
                },
                "I own a Telsa share stock (yes just one) During their earnings call I was able to vote when Elmo wanted to have his couple billion dollar pay out I was able to write a message to the board or someone not really sure how that works. I voted a no on the payout. Anyways I basically said Elmo needs to at least have less leverage on the direction of the company or step down from being CEO. Him meddling in politics shows he's not necessary and the primary reason why I've never even considered buying a Tesla. He's not doing his job as a CEO and hurting the image of the company. Give us a truck not a novelty item.": {
                    "Sentimental_Value": "Neutral"
                },
                "Aside from wanting attention for having one, there isn’t any real reason to get this car. It’s not a work car like the F150, it’s not great for off roading, it’s too clunky for soccer dads who just want an SUV,  and even if you’re a hardcore fanboy, the Model Y will be more usable.": {
                    "Sentimental_Value": "Neutral"
                },
                "[removed]": {
                    "Sentimental_Value": "Negative"
                },
                "Who's surprised that an overpriced niche item can't sustain its initial sales volume that was fed by influencers and look-at-me douchecanoes?": {
                    "Sentimental_Value": "Negative"
                },
                "MILLIONS of reservations??\n\nFord sold 750k F-series trucks in 2023, a massive increase in sales over 2022. \n\nNot F-150s. Not F-350s. Not Lightnings. \n\nF-series. All of them combined. \n\nI refuse to believe the Cybertruck had MILLIONS of reservations.\n\nEdit: ok, I did a lazy Google. Over 2 million reservations. Color me surprised.": {
                    "Sentimental_Value": "Neutral"
                },
                "I reserved one early. Such a cool concept and I had an aging F150 and money to spend. But after like four years of consuming negative press about the product and the reputation its drivers seem to have developed I’ve lost interest, despite daily driving Tesla S/X/3 in our household since 2018. If someone that invested in the brand is turning away you know there’s a problem.": {
                    "Sentimental_Value": "Negative"
                },
                "> There’s no way of confirming if this is related to a demand problem or something else.\n\n> In the first two quarters combined, 11,558 Cybertrucks were sold in the U.S., with the third quarter marking seeing 16,692 registrations. The numbers are on the rise, so it will be very interesting to see what will happen in the last quarter–will the numbers go up or down?\n\nSo the answer is we don’t actually know anything and are just putting out conjecture/a guess? What has happened to journalism these days, holy shit.": {
                    "Sentimental_Value": "Neutral"
                },
                "Free market at work": {
                    "Sentimental_Value": "Positive"
                },
                "Who would of thought that the world's ugliest and expensive truck would have no demand lol": {
                    "Sentimental_Value": "Neutral"
                },
                "Funny how when you become a megalomaniacal asshat people kinda want to stay away from you and everything you represent… everyone leaves Xtwitter and now Cyber Dumptrucks… people are voting with their wallets.": {
                    "Sentimental_Value": "Neutral"
                },
                "It's all just so pointless; if Tesla had made a more conventional truck it would have sold like crazy but no Elon's childish notion of selling a joke truck had to be taken to completion. Literally makes zero sense.": {
                    "Sentimental_Value": "Neutral"
                },
                "To the surprise of no one except Tesla cultists.": {
                    "Sentimental_Value": "Neutral"
                }
            }
        },
        "Tesla CEO Elon Musk loses bid to get $56 billion pay package reinstated": {
            "Post_Info": {
                "Title": "Tesla CEO Elon Musk loses bid to get $56 billion pay package reinstated",
                "Score": 8569,
                "Comments": 621,
                "Created": "2024-12-02 17:33:51",
                "Subreddit": "technology",
                "Author": "Shogouki",
                "URL": "https://www.cnbc.com/2024/12/02/tesla-ceo-elon-musk-loses-bid-to-get-56-billion-pay-package-reinstated.html",
                "Content": ""
            },
            "Comments": {
                "Some good news for a change.": {
                    "Sentimental_Value": "Positive"
                },
                "Get fucked, Space Karen": {
                    "Sentimental_Value": "Negative"
                },
                "Wasnt there an investor vote earlier this year that he won?\n\n\nEdit:\n\n> \"Even if a stockholder vote could have a ratifying effect, it could not do so here,\" Chancellor Kathaleen McCormick wrote in her opinion.": {
                    "Sentimental_Value": "Negative"
                },
                "I think it's wild how people keep putting money in that company. What happens when Elon takes too much Ketamine and leaves? Seems to me it will crash hard.": {
                    "Sentimental_Value": "Negative"
                },
                "But he's so smart, how else will we know how smart he is?": {
                    "Sentimental_Value": "Neutral"
                },
                "$56 billion is such a disgusting amount of money for a single person..... Tesla has roughly 121k employees, that would amount to a $462k per employee, no way musk is bringing anywhere near that value to the company, how the fuck do billionaires exist. Tesla could stick this money in standard 4% interest savings account and the interest alone would generate enough to cover $19k raise per employee and still have guess what 56 billion dollars in cash. How are people okay with this? How is anyone who works okay with this nonsense. There should be a cap on money you can make in a year how about a million times minimum wage, no one is doing anything worth a million times more than anyone. Fuck this timeline": {
                    "Sentimental_Value": "Negative"
                },
                "Spoiler alert - this will get appealed to the Supreme Court, and the Supreme Court will rule in favor of Elon.\n\nEdit:  I don’t have to look at the details of the case.  Musk has Trump in his pocket , and Trump has the Supreme Court in his pocket.  ": {
                    "Sentimental_Value": "Neutral"
                },
                "It’s nauseating that one single person can own that much money.": {
                    "Sentimental_Value": "Negative"
                },
                "Glad to hear it!  Couldn't happen to a nicer cancerous anal polyp.": {
                    "Sentimental_Value": "Neutral"
                },
                "Reading the article makes me sick. It’s like we live in the real world and these billionaires live in an entirely different fantasy land where they just get richer off of us and we know very little about it or how it works because the system was rigged against us from the start.": {
                    "Sentimental_Value": "Negative"
                },
                "Good. Fuck him": {
                    "Sentimental_Value": "Negative"
                },
                "Following the January decision, Musk lashed out at the Delaware court, posting on X, “Never incorporate your company in the state of Delaware.”\n\nAnd why were you incorporated there in the first place, hmmmmm?????": {
                    "Sentimental_Value": "Negative"
                },
                "pocket change compared to what he will reap from the corruption he is about to perpetrate": {
                    "Sentimental_Value": "Negative"
                },
                "That's like $8,000 from the sale of every Tesla produced, handed to Musk.... I seriously doubt they've made the kinds of margins that would allow for even a hundredth of that": {
                    "Sentimental_Value": "Negative"
                },
                "I too asked for a raise and was denied. Tough times these days": {
                    "Sentimental_Value": "Negative"
                },
                "I don't understand.\n\nThe company is owned by shareholders.\n\nHe had an agreement with them on managing the company and his kpi was share price, which benefitted all the other share holders.\n\nHe didn't get a pay in return for that so basically if company didn't do well he is not paid.\n\nSo why isn't he getting paid now seeing how the share price rocketed?\n\nAnd I don't even own Tesla shares": {
                    "Sentimental_Value": "Negative"
                },
                "It's funny and this will eventually fall apart.\n\nThe entire argument is that it's not about the number of shares or their value but that the deal was made under allegedly fraudulent circumstances (stock holders at the time had different information than the insiders). And in her first sentence, the judge makes a comment that seemingly makes it all about the amount of money in question:\n\n> ... asserting fiduciary challenges to the largest executive compensation award in the history of public markets": {
                    "Sentimental_Value": "Negative"
                },
                "Hahaha good Elon can get fucked.": {
                    "Sentimental_Value": "Positive"
                },
                "Dude wanted to be paid more than 3.5 times what the company made in net income in 2023. This pay package would have caused the company to experience a loss for the first time since 2019. In fact it would have been their largest ever loss.": {
                    "Sentimental_Value": "Negative"
                },
                "Oh no, how can he afford avocado toast and Starbucks now?": {
                    "Sentimental_Value": "Negative"
                },
                "$345 million to the lawyers who brought the lawsuit is absolutely insane.": {
                    "Sentimental_Value": "Negative"
                },
                "If the company was privately owned, Musk could choose to pay himself any amount.\n\nBecause he took his company public and sold shares of it to the public, it now falls under the purview of the legal system.  He can work with the court to get paid, but the court now has a say in how things are done.  The legal system can hold companies accountable, even if their stock holders would rather they not.  \n\nIf Musk repurchase the outstanding shares, he can make Tesla private.": {
                    "Sentimental_Value": "Negative"
                },
                "Why is everyone in here acting like this vote was their choice when retail investors hold like 40% stake in Tesla… lmao": {
                    "Sentimental_Value": "Negative"
                },
                "How is a judge being able to block shareholder decisions like this?": {
                    "Sentimental_Value": "Negative"
                },
                "$56B is well over a billion a week which works out to $25m per hour. I agree with the judge. A bit excessive at $7k per second.": {
                    "Sentimental_Value": "Negative"
                },
                "Actual court filing is here for those who want more details.\n\nhttps://courts.delaware.gov/Opinions/Download.aspx?id=372420": {
                    "Sentimental_Value": "Neutral"
                },
                "Full disclaimer: not an Elon fan boy, you’re welcome to browse my history. \n\nThis decision, first and now second time is beyond asinine. \n\nWhen this compensation package was voted in, it was a literal laughing stock of an idea. You can still YouTube the CNBC clips. \n\nThe targets were so far out of the money it was an absolute slam dunk for the shareholders.  There was no one except for Elon that thought this was a good idea. \n\nSo to then revise this because Elon managed to hit these absolutely ridiculous targets is absolutely absurd and incorrect. \n\nI completely disagree with these decisions.": {
                    "Sentimental_Value": "Negative"
                },
                "How can a judge decide what’s “excessive” but then decide that awarding the attorneys $345 million isn’t?  Seems excessive to me.": {
                    "Sentimental_Value": "Negative"
                },
                "Idiot's trying to cover his $44B losses from buying and ruining Twitter": {
                    "Sentimental_Value": "Negative"
                },
                "[removed]": {
                    "Sentimental_Value": "Negative"
                },
                "Lol. Vote passed overwhelmingly twice. But judge says nah. Lol.\n\nWe gotta vote again it seems.": {
                    "Sentimental_Value": "Neutral"
                },
                "I hate Musk as much as the next guy, but how can a judge overrule what owners of a company pays their CEO?\n\nThe shareholders collectively agreed via a vote to approve the compensation package, how can any judge overrule this? What law is being broken here? I am honestly confused...": {
                    "Sentimental_Value": "Negative"
                },
                "ITT, all the troll farms from the election reactivated to try to get Elon a payout after illegally colluding with the board of directors.": {
                    "Sentimental_Value": "Neutral"
                },
                "The shocking thing for me is that the courts are taking this action, but it seems Elon can get away with massive stock price manipulation through his hugely misleading public statements for years.": {
                    "Sentimental_Value": "Neutral"
                },
                "The myth of consensual compensation:\n\nElon: I consent\n\nShareholders: I consent\n\nJudge: I don’t \n\nIs there somebody you forgot to ask?": {
                    "Sentimental_Value": "Negative"
                },
                "That a judge can call a pay package “excessive” and nullify it on those grounds AFTER the initial problems were fixed with a 2nd shareholder vote is actually scary. ": {
                    "Sentimental_Value": "Negative"
                },
                "The ruling raises serious questions about shareholder rights. If a majority of shareholders voted to approve a pay package, how can a judge nullify that decision? It feels like a dangerous precedent where courts can override the will of the owners, undermining the very essence of public companies. Shouldn't the shareholders have the final say in how their company is run?": {
                    "Sentimental_Value": "Negative"
                },
                "The judge thinks the pay package is excessive yet then awards attorneys over 300 million... The fuck lol": {
                    "Sentimental_Value": "Negative"
                },
                "The happy ending. Hope this shit is done for good.": {
                    "Sentimental_Value": "Positive"
                },
                "Question to shareholders that voted in favor of passing this package. \n\nWhy?": {
                    "Sentimental_Value": "Negative"
                }
            }
        },
        "Tesla Cybertruck Immediately Dies in Canadian Winter – Owner Bricks the Truck Trying to Use the Defroster, Says “In Love to Heartbroken on the Same Day”": {
            "Post_Info": {
                "Title": "Tesla Cybertruck Immediately Dies in Canadian Winter – Owner Bricks the Truck Trying to Use the Defroster, Says “In Love to Heartbroken on the Same Day”",
                "Score": 5356,
                "Comments": 477,
                "Created": "2024-12-03 14:09:40",
                "Subreddit": "technology",
                "Author": "RGV_KJ",
                "URL": "https://www.torquenews.com/11826/tesla-cybertruck-immediately-dies-canadian-winter-owner-bricks-truck-trying-use-defroster",
                "Content": ""
            },
            "Comments": {
                "> Finally, Rob concludes his post with a picture of his Cybertruck loaded onto a flatbed. Most people would be unhappy with this sight, but Rob doesn’t seem too bothered writing, “Note: My Cybertruck does look awesome on that tow truck!”\n\n\nI can't even make a joke that is funnier than this.": {
                    "Sentimental_Value": "Neutral"
                },
                "\"Still love the truck Mr. Musk sir!\"": {
                    "Sentimental_Value": "Positive"
                },
                "  \nThe last line... Just wow....\n\n>Note: My Cybertruck does look awesome on that tow truck!": {
                    "Sentimental_Value": "Positive"
                },
                "It's insane people keep buying those things, they must be living under rocks or do absolutely no research before purchasing because it is widely known at this point that the car is plagued with issues.": {
                    "Sentimental_Value": "Neutral"
                },
                "Is this an indoor truck?": {
                    "Sentimental_Value": "Neutral"
                },
                "I tried to use the defroster and it froze. \n\nTry turning it off and back on again.\n\nI work in IT. Therefore I drive a car that's as mechanical as I can manage.": {
                    "Sentimental_Value": "Negative"
                },
                "The Deplorean": {
                    "Sentimental_Value": "Negative"
                },
                "The joke of the week. “In Love to Heartbroken on the Same Day”.": {
                    "Sentimental_Value": "Positive"
                },
                "Musk mostly sells illusions. Expensive ones.": {
                    "Sentimental_Value": "Negative"
                },
                "Imagine being in love with a dumpster.": {
                    "Sentimental_Value": "Neutral"
                },
                "Cybertruck owners are weird. It's like they're suffering from Stockholm Syndrome after volunteering to be kidnapped.": {
                    "Sentimental_Value": "Neutral"
                },
                "Tesla is crap": {
                    "Sentimental_Value": "Negative"
                },
                "Anyone driving this thing is declaring to the world: “I’m an idiot!”.": {
                    "Sentimental_Value": "Neutral"
                },
                "It’s autumn": {
                    "Sentimental_Value": "Positive"
                },
                "They say don't buy a car in the first year model.. maybe extend this one a year or two.": {
                    "Sentimental_Value": "Negative"
                },
                "Designed to hold up to the most severe San Francisco winter.": {
                    "Sentimental_Value": "Positive"
                },
                "While Cybertrucks my be jokes, their owners are even bigger ones. \"My cybertruck looks awesome on that tow truck!\" I have to imagine these owners are insecure, man children desperate to be seen as cool or more likely even just noticed in life. So desperate for attention they've deluded themselves into thinking everyone looking at them arent also laughing at them.": {
                    "Sentimental_Value": "Neutral"
                },
                "Canadian here - saw my first Cybertruck in the wild yesterday at a red light.  We were laughing, the car behind us was laughing and the car behind the Cybertruck was laughing cause we know that thing probably won’t survive the winter": {
                    "Sentimental_Value": "Neutral"
                },
                "I don't know how anyone can actually look at this piece of shit vehicle and think it looks even remotely good. Or feel proud to support a Nazi pedophile immigrant that's fucking with the US for his own gain.": {
                    "Sentimental_Value": "Neutral"
                },
                "There’s a sucker born every minute.": {
                    "Sentimental_Value": "Neutral"
                }
            }
        },
        "Tesla sued by deceased driver’s family over 'fraudulent misrepresentation' of Autopilot safety": {
            "Post_Info": {
                "Title": "Tesla sued by deceased driver’s family over 'fraudulent misrepresentation' of Autopilot safety",
                "Score": 3342,
                "Comments": 123,
                "Created": "2024-12-09 20:45:32",
                "Subreddit": "technology",
                "Author": "No-Information6622",
                "URL": "https://www.cnbc.com/2024/12/09/tesla-accused-of-fraudulent-misrepresentation-of-autopilot-in-crash-.html",
                "Content": ""
            },
            "Comments": {
                "The incident involved a 2021 Model S, which **smashed into a parked fire truck while the driver was using Tesla’s Autopilot**, a partially automated driving system.\n\nMendoza’s attorneys alleged that Tesla and Musk have **exaggerated or made false claims about the Autopilot system** for years in order to, “generate excitement about the company’s vehicles and thereby improve its financial condition.” They pointed to tweets, company blog posts, and remarks on earnings calls and in press interviews.\n\nIn their response, Tesla attorneys said the driver’s “**own negligent acts and/or omissions**” were to blame for the collision, and that “reliance on any representation made by Tesla, if any, was not a substantial factor” in causing harm to the driver or passenger. They claim Tesla’s cars and systems have a “reasonably safe design,” in compliance with state and federal laws.": {
                    "Sentimental_Value": "Neutral"
                },
                "The phrases \"autopilot\" and \"fully self driving\" don't leave a ton of room for interpretation. \n\nThere's a reason GM and Ford have \"Super Cruise\" and \"Blue Cruise\" respectively. It does self driving on the highway, but the freaking name doesn't advertise it as FULLY SELF DRIVING.": {
                    "Sentimental_Value": "Neutral"
                },
                "Yeah I can’t tell you how many people I’ve talked to friend and family included who believe Tesla auto pilot is fully autonomous and you can fall asleep without worry. The false advertising behind the term is without a doubt lead to accidents and deaths because of it.": {
                    "Sentimental_Value": "Neutral"
                },
                "Everyone thinks it is fully self driving, except for those who have learned the hard way or read about those people. I know people who bought the car thinking it was that way. Only to find out it wasn’t. Obviously Tesla has created a buzz based on a marketing campaign that was based on their future hope rather than today’s reality.  My GMC and Camry are about as autonomous.": {
                    "Sentimental_Value": "Negative"
                },
                "Maybe they can CEO the CEO.": {
                    "Sentimental_Value": "Negative"
                },
                "Just you wait until this fraudulent autopilot is released on our streets.": {
                    "Sentimental_Value": "Negative"
                },
                "Why is Tesla allowed to beta test autopilot on public roads?": {
                    "Sentimental_Value": "Negative"
                },
                "Isn’t there like a forced arbitration clause?": {
                    "Sentimental_Value": "Neutral"
                },
                "it would be great if tesla loses": {
                    "Sentimental_Value": "Neutral"
                },
                "Let's also recognize the system doesn't recognize emergency vehicles. I have watched an ambulance on the highway, lights and sirens going and the Tesla not attempt to get out of the way. \n\nAdmittedly that assumes the driver wasn't in control and just wholly ignorant.": {
                    "Sentimental_Value": "Neutral"
                },
                "You have to watch the road in case it makes a mistake like it’s a student driver that is deaf and has hallucinations. So nah drivers fault": {
                    "Sentimental_Value": "Neutral"
                },
                "Tesla isn't the only car company with some sort of autonomous driving functionality. Why is it that we seem to only get news about Tesla accidents, but not others?": {
                    "Sentimental_Value": "Negative"
                },
                "Remind me of the people sue the RV maker for their crash. They turned on their “autopilot” feature and went to the back of their RV.": {
                    "Sentimental_Value": "Negative"
                },
                "I used to think Tesla FSD was amazing until I started regularly taking Waymos. Telsa FSD feels like a teen learning to drive in comparison. But it's still way ahead of what anyone else is doing in personal vehicles by a mile.": {
                    "Sentimental_Value": "Positive"
                },
                "All automatic in the LIFE can cause the lazyness of the humanity. The GREAT example is the autopilot.": {
                    "Sentimental_Value": "Positive"
                },
                "This makes me put SoMucHFaItH in the trump admin. ": {
                    "Sentimental_Value": "Negative"
                },
                "Tesla’s self driving capabilities are incredible and it’s definitely the future of driving. That being said, you still need to pay attention when using the feature. The car often makes you and will turn off if you are not. \n\nYou also know things the car has trouble with so you take over during those times.": {
                    "Sentimental_Value": "Neutral"
                },
                "This exact case has been tried so many times, with each case making it to the front of Reddit that I have to laugh. You buy the car, you agree that YOU ARE RESPONSIBLE, not the car. You are behind the wheel, you are the one responsible for it's safety. End of story. End of court case. As much of a hate boner Reddit has for Tesla/Elon, this is open and shut. End of story. Tesla will win this case. As usual. It's clear as day. Yawn.": {
                    "Sentimental_Value": "Neutral"
                }
            }
        },
        "Tesla shares climb to record, boosted by 64% pop since Trump election victory": {
            "Post_Info": {
                "Title": "Tesla shares climb to record, boosted by 64% pop since Trump election victory",
                "Score": 368,
                "Comments": 382,
                "Created": "2024-12-11 13:11:55",
                "Subreddit": "stocks",
                "Author": "Puginator",
                "URL": "https://www.reddit.com/r/stocks/comments/1hbzw2i/tesla_shares_climb_to_record_boosted_by_64_pop/",
                "Content": "Tesla shares jumped to an all-time high on Wednesday, surpassing their prior record reached in 2021, sparked by a post-election rally and Wall Street’s increased enthusiasm for Elon Musk’s electric vehicle company.\n\nThe stock rose to an intraday high of $415, which is 50 cents above its previous peak, and was on pace to close ahead of its highest finish, which was $409.97 on Nov. 4, 2021.\n\nTesla’s market value has swelled by about 66% this year, with almost all of those gains coming since Donald Trump’s election victory early last month. The stock’s 38% rally in November marked its best monthly performance since January of 2023 and its 10th best on record.\n\nMusk poured $277 million into a pro-Trump campaign effort, according to Federal Election Commission filings, and turned his support for the Republican nominee into another full-time job ahead of the election, funding a swing-state operation to register voters and using his social media platform X to constantly tout his preferred candidate, frequently with misinformation.\n\nThe world’s richest person, who’s seen his net worth swell to over $360 billion, is set to lead the Trump administration’s “Department of Government Efficiency,” alongside onetime Republican presidential candidate Vivek Ramaswamy.\n\nHis new role could give Musk power over federal agencies’ budgets, staffing and the ability to push for the elimination of inconvenient regulations. Musk said during a Tesla earnings call in October that he intended to use his sway with Trump to establish a “federal approval process for autonomous vehicles.” Currently, approvals happen at the state level.\n\n“The stock is responding to the Trump bump,” Craig Irwin, an analyst at Roth MKM, told CNBC’s “Squawk on the Street” last week. Irwin had just increased his price target to $380 from $85, writing in a report that “Musk’s authentic support for Trump likely doubled Tesla’s pool of enthusiasts and lifted credibility for a demand inflection.”\n\nOn Wednesday, analysts at Goldman Sachs boosted their price target on Tesla, joining a parade of firms that have lifted their price expectation or their rating on the stock. The Goldman analysts wrote that “the market is taking a more forward-looking approach to Tesla, including with respect to its AI opportunity.”\n\nAnalysts at Morgan Stanley and Bank of America have also issued bullish reports of late.\n\nSince Trump’s victory, Musk has been accompanying the president-elect in meetings with world leaders, and began advising him and members of Congress as to which federal agencies, regulations and budget items the billionaire would like to eliminate or greatly reduce.\n\nTesla’s surge to a record marks a dramatic turn from its performance to start the year. The company’s shares plunged 29% in the first three months of 2024, the worst quarter for the stock since the end of 2022 and the third worst since Tesla went public in 2010. At the time, investors were concerned about Tesla’s core business, which reported declining revenue in the first quarter in part due to increased competition from China.\n\nIn its third-quarter earnings report in October, Tesla reported a year-over-year revenue increase of 8%, which fell just shy of estimates. However, the company reported better-than-expected profit, and Musk said on the earnings call that his “best guess” is that “vehicle growth” will reach 20% to 30% next year, due to “lower cost vehicles” and the “advent of autonomy.” That forecast was ahead of analysts’ predictions.\n\nSource: [https://www.cnbc.com/2024/12/11/tesla-reaches-record-boosted-by-64percent-pop-since-trump-election-victory.html](https://www.cnbc.com/2024/12/11/tesla-reaches-record-boosted-by-64percent-pop-since-trump-election-victory.html)"
            },
            "Comments": {
                "Hi, you're on r/Stocks, please make sure your post is related to stocks or the stockmarket or it will most likely get removed as being off-topic/political; feel free to edit it now and be more specific.\n\n**To everyone commenting:**  Please focus on how this affects the stock market or specific stocks or it will be removed as being off-topic/political.\n\nIf you're interested in just politics, see our wiki on [\"relevant subreddits\"](https://www.reddit.com/r/stocks/wiki/index) and post to those Reddit communities instead without linking back here, thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*": {
                    "Sentimental_Value": "Neutral"
                },
                "Want to buy puts, but this has become such a meme stock that there's no chart set-up that can be trusted...": {
                    "Sentimental_Value": "Negative"
                },
                "What’s really insane is that the “overvalued” argument is easy to make here…and somehow it was at this level 3 years ago.\n\nSPY was around $470 (-23% from its current price) last time TSLA was at this level.": {
                    "Sentimental_Value": "Negative"
                },
                "The collapse is going to be incredible": {
                    "Sentimental_Value": "Positive"
                },
                "Genuinely crazy how Pelosi (rightly) gets shit on for her trading yet Trump backers and billionaires are able to so flagrantly profit off of the priced in assumption of the inevitable corruption they’ll benefit from.": {
                    "Sentimental_Value": "Negative"
                },
                "At this point, even if spy crashes 20%, it's only going to go 480 which is also not cheap. Rate cuts will only make things go higher.": {
                    "Sentimental_Value": "Negative"
                },
                "Stop trying to figure out valuation of companies owned by oligarchs.\n\nIf a company has access to govt, it can create insane amount of profit and can funnel it into govt to make sure that govt stays there for a long time.": {
                    "Sentimental_Value": "Negative"
                },
                "meme stock": {
                    "Sentimental_Value": "Neutral"
                },
                "I'm so happy I did the opposite of all the shitty advice here and DCA into TSLA the past 3 years.": {
                    "Sentimental_Value": "Neutral"
                },
                "All I ask is for the Redditors that pestered me with remindme comments while the stock was down to do the same when it’s up 😘": {
                    "Sentimental_Value": "Neutral"
                },
                "Some people are big mad in this thread![gif](emote|free_emotes_pack|joy)": {
                    "Sentimental_Value": "Negative"
                },
                "Just search old posts from 2012, and you will find plenty of \"smart\" Redditors claiming TSLA was way overvalued at $10. \n\nWhich is fine because it allows those who can see the future to accumulate stocks like TSLA and NVDA while others laugh at us. \n\nMeanwhile we get to retire in our 30s or 40s while those who screaming \"bubble, overvalued, corruption, meme stock\" can continue to miss out generational wealth.": {
                    "Sentimental_Value": "Neutral"
                },
                "This company has never traded on fundamentals. Still not touching this.": {
                    "Sentimental_Value": "Negative"
                },
                "Soon at Cathie buys, look out!!!": {
                    "Sentimental_Value": "Positive"
                },
                "Does that mean GOP is now green?": {
                    "Sentimental_Value": "Negative"
                },
                "It's funny how people still think the stock market is tied to any fundamentals. The market it a casino for Wall Street and has been for a long time. You can make (also lose) a lot of money both swing and position trading off technical signals.": {
                    "Sentimental_Value": "Negative"
                },
                "Inverse Reddit, undefeated.": {
                    "Sentimental_Value": "Negative"
                },
                "Overvalue stock, really can’t justify the valuation like PLTR": {
                    "Sentimental_Value": "Negative"
                },
                "The salt here is delicious.": {
                    "Sentimental_Value": "Positive"
                },
                "I see the salt mines are still open, and producing well. I don't hold any Tesla but it's hilarious to watch the hand wringing, both here, and in the electric vehicles sub. \"Wealthy people have political influence. More at 11.\" I appreciate that there is a whole new generation of young people who've never seen it \"in person\" before, but it's nothing new. They only thing that's new is social media and everyone having a phone in their hand. I think Tesla is over valued, but in comparison to other over valued stocks, it's actually not that insane. They do have a big presence in grid energy storage, for example, and their manufacturing prowess is acknowledged among engineers fairly universally. Just watch a video of their production lines versus legacy auto, and it's quite obvious there's is big talent behind their processes. Does that justify the meme status? Not really. But you can't just compare them to legacy auto and say \"overvalued\" as if that's the entire picture.": {
                    "Sentimental_Value": "Neutral"
                }
            }
        },
        "Shorting Tesla": {
            "Post_Info": {
                "Title": "Shorting Tesla",
                "Score": 137,
                "Comments": 374,
                "Created": "2024-12-08 10:07:19",
                "Subreddit": "stocks",
                "Author": "Negative-River-2865",
                "URL": "https://www.reddit.com/r/stocks/comments/1h9krb0/shorting_tesla/",
                "Content": "Tesla went up almost 50% after Trump won elections. Although they are friends, Trump might revoke the EV tax credits. And if not Tesla will most likely be excluded from California's EV tax credits which is the inspiration for 12 other states that may or may not follow California's example.\n\nFurther Tesla is becoming less of an exclusive brand and revenue (which hasn't seen real growth the last quarters) is mainly from more discounted cars. Of course Tesla is more than just the cars, but it is their core business..\n\nDo you think lower revenue might tank the stock or will it still be interesting due to the different other businesses or that Elon Musk as a CEO is already enough to keep investors in."
            },
            "Comments": {
                "Hedge funds have given up trying to short Tesla.  You can try it as we all know it’s going to go down at some point but you’re fight isnt against teslas revenue, its against Elon musks popularity.  This place is riddled with corpses from ppl that tried and failed to short Tesla": {
                    "Sentimental_Value": "Neutral"
                },
                "You’ll be doing all this math and Elon will tweet butthole and the stock goes up 40 bucks": {
                    "Sentimental_Value": "Neutral"
                },
                "Here’s what will happen next earnings. They’ll miss on revenue and eps, stock will initially tank and then Elon will mention that Tesla will be taking in 4 trillion a year in revenue on Optimus robots in 2030. Dan Ives will boost his Tesla price target to $700 and then it will pump Tesla to a PE of 300. Enjoy the show.": {
                    "Sentimental_Value": "Positive"
                },
                "Why short any stock in a bull market? You are taking unnecessary risk when you could just buy literally any stock, in this market, and make a good return.": {
                    "Sentimental_Value": "Negative"
                },
                "Be careful a lot of people have been wrecked shorting Tesla": {
                    "Sentimental_Value": "Negative"
                },
                "Do it. And post your loss here after.": {
                    "Sentimental_Value": "Positive"
                },
                "TSLA rises thanks to short sellers giving up": {
                    "Sentimental_Value": "Negative"
                },
                "The market can remain irrational longer than you can remain solvent": {
                    "Sentimental_Value": "Negative"
                },
                "This might surprise you, but Trump revoking EV tax credits could be profitable for Tesla. Without the EV tax credit, it will be impossible for its competitors to compete with Tesla and they will have no choice to leave Tesla in a monopoly position in the EV car sector, as they will be the only one able to survive. \n+ it will prevent any company that want to get into this market to do so.": {
                    "Sentimental_Value": "Negative"
                },
                "Investing in Tesla = investing in Elon. The stock is so unpredictable and volatile because of this mentality. This company does not trade like any other automotive companies and is driven on pure speculation. For me, it’s a hard company to use logistics and financial to determine where it might go": {
                    "Sentimental_Value": "Neutral"
                },
                "Shorting tesla, are you mad. Even before Elon became first lady, tesla already defied gravity.": {
                    "Sentimental_Value": "Negative"
                },
                "Do it. But please post your losses. They sustain me.": {
                    "Sentimental_Value": "Negative"
                },
                "I’m going long on tsla everyone hating on tsla often means it’s a great stock.": {
                    "Sentimental_Value": "Negative"
                },
                "Credits going away is actually a good thing long term IMO for Tesla because they’re basically the only automaker who can make lots of EVs at scale profitably even without the credit. \n\nThe vehicles are like the iPhone was for Apple and are more of a platform for future earnings than for earnings themselves.": {
                    "Sentimental_Value": "Positive"
                },
                "People have been shorting tesla and losing for the last 4 years. Why do you think it's going to be different this time?": {
                    "Sentimental_Value": "Negative"
                },
                "First quarter of 2025. Shanghai megapack factory is coming online. 40gwh. 30% margin. Also before you buy puts. Watch the latest video on fsd v13. Semi factory is being built now. New smaller car is coming first half of next year. Robotaxi is already being internally trialed and will launch end of next year or 2026.  \nDo you really want to short ? \n\nDon’t go against the momentum": {
                    "Sentimental_Value": "Positive"
                },
                "Shorting a long term play like Tesla based on short term news with zero effect on the long term results of the business is a fool's errand.": {
                    "Sentimental_Value": "Negative"
                },
                "This is a great idea. So many people become very rich shorting TSLA. You can be the next Michael Barry!": {
                    "Sentimental_Value": "Positive"
                },
                "Getting rid of the ev vehicle tax credit hurts everyone else way more than it hurts for Tesla. I know California is an exception but I’m guessing Elon is going to sue that state over picking favorites. \nAll other ev manufacturers lose an assload of money off their evs where Tesla makes money off their evs. The other guys will have to raise their prices of their ev or eat a further loss on their evs.": {
                    "Sentimental_Value": "Negative"
                },
                "NGL for my Tesla is not about the EV but the self driving AI. There is nothing special about making a EV there are a few dozen Chinese auto makers that make Tesla quality EVs. You know how many car companies have cars that can realistically take you from A to B. 1 Tesla": {
                    "Sentimental_Value": "Neutral"
                }
            }
        }
    },
    "Twitter": {
        "Reddit overtakes X in popularity of social media platforms in UK $RDDT": {
            "Post_Info": {
                "Title": "Reddit overtakes X in popularity of social media platforms in UK $RDDT",
                "Score": 1068,
                "Comments": 157,
                "Created": "2024-11-28 09:25:22",
                "Subreddit": "stocks",
                "Author": "caollero",
                "URL": "https://www.reddit.com/r/stocks/comments/1h1x2aj/reddit_overtakes_x_in_popularity_of_social_media/",
                "Content": "[https://www.theguardian.com/technology/2024/nov/28/reddit-overtakes-x-in-popularity-of-social-media-platforms-in-uk](https://www.theguardian.com/technology/2024/nov/28/reddit-overtakes-x-in-popularity-of-social-media-platforms-in-uk)\n\nReddit, the American online discussion platform, has overtaken X to become the fifth most popular social media platform in the UK, according to the communications watchdog.\n\nOfcom said Reddit, where users post on discussion threads within topic-based communities, was visited by 22.9 million UK adults in May this year, compared with 22.1 million on X.\n\nThe figures make Reddit the fastest-growing large social media platform in the UK and represent a growth of 47% on the same period in 2023. The leap took Reddit above LinkedIn and X into fifth place on the table of UK social media platforms, which is now topped by YouTube after it overtook [Facebook](https://www.theguardian.com/technology/facebook), reaching more than 44 million adults.\n\nReddit, renowned for its devoted user base who refer to one another as Redditors, appears to have been boosted by updates to Google’s search engine this year.\n\nFarhad Divecha, the managing director of the UK-based digital marketing agency AccuraCast, said: “Google’s latest algorithm update in the first half of 2024 gave Reddit a big boost in organic search traffic. I think that has probably contributed a lot.”\n\nOfcom also speculated that the change may have been caused [by alterations to how third-party apps accessed its content](https://www.theguardian.com/technology/2023/jun/14/reddit-moderators-vow-to-continue-blackout-in-api-access-fees-row), forcing users of those apps to switch to the Reddit site. The watchdog also flagged publicity around Reddit’s stock market flotation in March this year.\n\nThe popularity of X also fell over the same period, according to Ofcom, with its reach falling by 8% since May last year. X has been criticised over content moderation standards since its [takeover by Elon Musk in 2022](https://www.theguardian.com/technology/2022/oct/28/elon-musk-twitter-hate-speech-concerns-stock-exchange-deal) but it has also faced competition since July 2023 from Threads, a rival to X [launched by Mark Zuckerberg’s Meta](https://www.theguardian.com/technology/2023/jul/06/meta-launches-twitter-rival-threads-in-100-countries).\n\nThe Ofcom figures featured in the watchdog’s annual report into the nation’s digital habits, which revealed that four out of 10 UK adults say they have encountered misinformation or deepfakes, with the majority of those cases occurring online.\n\nThe misinformation survey, based on a poll of more than 4,000 UK adults, also found that three in 10 adults believe there is a single group of people who control the world together, with the same number believing there is “significant evidence” of electoral fraud in the UK.\n\nThe regulator also found that one-third of UK adults are not confident in judging whether an image or a piece of audio or video has been created by artificial intelligence."
            },
            "Comments": {
                "Enjoying Reddit less the more popular it gets": {
                    "Sentimental_Value": "Negative"
                },
                "I'm curious how they define popularity of any of these sites, especially when it comes to determining whether to include bots.": {
                    "Sentimental_Value": "Negative"
                },
                "26b for the 6th most visited website seems low": {
                    "Sentimental_Value": "Negative"
                },
                "What does the election fraud stuff at the end have to do with X's stock? Hello bot?": {
                    "Sentimental_Value": "Negative"
                },
                "Twitter fucking blows": {
                    "Sentimental_Value": "Negative"
                },
                "The election is over. The paid bots are gone. I'm not buying this. They may have one more good earnings, but it's going downhill after the election season. \n\nUK has it's own issues, which makes Reddit relevant for them, but overall, Reddit, I don't expect Reddit to do well. This is reflected in a lot of media outlets that rely on a left leaning base and ratings massively dropped.": {
                    "Sentimental_Value": "Negative"
                },
                "I like Reddit": {
                    "Sentimental_Value": "Positive"
                },
                "I’m sure that Reddit is taking over a fair share of Social Media in the future… as specific forums/boards are kind of dead, Reddit is the place to go at this point of time (FB groups aren’t a competition imo)\nI’ll put some play money on it… let’s see what happens!": {
                    "Sentimental_Value": "Positive"
                },
                "X is shit and gone worse under Elon Musk. \nReddit ⬆️ X ⬇️": {
                    "Sentimental_Value": "Neutral"
                },
                "Yeahhh I don't buy that for a second. Reddit used to be great but now it's just a wasteland and an echo chamber by comparison.": {
                    "Sentimental_Value": "Negative"
                },
                "The funniest thing about reddit is that people love to spend their time complaining on reddit about how reddit sucks. They are kind of like star wars fans. They hate everything that got released since the original trilogy but they nonetheless consume everything star wars related voraciously.  \n\nThe protest thing over the API was so funny to me. Just stop going to reddit, stop giving them engagement, that's how you can hurt reddit the most. Not posting memes about fuck spez or whatever. People just love this site, they can't get off of it. \n\nThat's one of the reason I'm long this stock.": {
                    "Sentimental_Value": "Negative"
                },
                "I don't even know how X is measured. They're such an overwhelming number of marketing accounts and bots. With Reddit those accounts are actively driven off": {
                    "Sentimental_Value": "Neutral"
                },
                "The question is when do we start seeing marketing shops offerring Reddit ads as services. It's still quite niche. Look up any local ad shop near you and see if they mention they offer Reddit ads as a service. My guess is you won't find any..they focus on Google  / Meta etc.": {
                    "Sentimental_Value": "Negative"
                },
                "OP: Reddit overtakes X in popularity\n\nMe: Oh damn thats huge\n\nOP: In the UK\n\nMe: Oh never mind": {
                    "Sentimental_Value": "Neutral"
                },
                "..people love an echo chamber.": {
                    "Sentimental_Value": "Positive"
                },
                "I don't buy this article at all.   This is institutions whobown Redit wanting retail to jump in.  \n\nRrdit is nothing more than Facebook 2.0.....": {
                    "Sentimental_Value": "Negative"
                },
                "X is worthless so what does this mean": {
                    "Sentimental_Value": "Negative"
                },
                "Anyone can get to #1 with enough bots making trash ai posts all the time.": {
                    "Sentimental_Value": "Negative"
                },
                "X is more like small texting vs RDDT email chains\n\nMore content without so much personal weight\n\nYou know like less influencer type content": {
                    "Sentimental_Value": "Neutral"
                },
                "X got soft locked, less then rumble but close...": {
                    "Sentimental_Value": "Neutral"
                }
            }
        }
    }
}